{"title":"Encryption - Crypto 101 - THM Walkthrough","uid":"47e2aeaa7cfad81b420e64c0e671a73f","slug":"Encryption-101","date":"2024-05-21T10:34:20.000Z","updated":"2024-05-22T16:57:56.227Z","comments":true,"path":"api/articles/Encryption-101.json","keywords":null,"cover":"https://assets.tryhackme.com/img/modules/cryptography.png","content":"<p><strong>Hello Hackers 🚀</strong><br>Today we are gonna walkthrough a new room on <em>Try Hack Me</em> called <em>“<a href=\"https://tryhackme.com/r/room/encryptioncrypto101\">Encryption - Crypto 101</a>“</em></p>\n<h1 id=\"TASK-1-What-will-this-room-cover\"><a href=\"#TASK-1-What-will-this-room-cover\" class=\"headerlink\" title=\"TASK 1 - What will this room cover?\"></a>TASK 1 - What will this room cover?</h1><p><strong>This room will cover:</strong></p>\n<ul>\n<li>Why cryptography matters for security and CTFs</li>\n<li>The two main classes of cryptography and their uses</li>\n<li>RSA, and some of the uses of RSA</li>\n<li>2 methods of Key Exchange</li>\n<li>Notes about the future of encryption with the rise of Quantum Computing<br><code>Note:</code> This room expects some familiarity with tools, and some research into how to use them yourself!</li>\n</ul>\n<h1 id=\"TASK-2-Key-Terms\"><a href=\"#TASK-2-Key-Terms\" class=\"headerlink\" title=\"TASK 2 - Key Terms\"></a>TASK 2 - Key Terms</h1><p>Many of these key terms are shared with <a href=\"https://tryhackme.com/room/hashingcrypto101\">https://tryhackme.com/room/hashingcrypto101</a>, so you might be able to skip over some if you’re already familiar.</p>\n<ul>\n<li><code>Ciphertext</code> - The result of encrypting a plaintext, encrypted data</li>\n<li><code>Cipher</code> - A method of encrypting or decrypting data. Modern ciphers are cryptographic, but there are many non cryptographic ciphers like Caesar.</li>\n<li><code>Plaintext</code> - Data before encryption, often text but not always. Could be a photograph or other file</li>\n<li><code>Encryption</code> - Transforming data into ciphertext, using a cipher.</li>\n<li><code>Encoding</code> - NOT a form of encryption, just a form of data representation like base64. Immediately reversible.</li>\n<li><code>Key</code> - Some information that is needed to correctly decrypt the ciphertext and obtain the plaintext.</li>\n<li><code>Passphrase</code> - Separate to the key, a passphrase is similar to a password and used to protect a key.</li>\n<li><code>Asymmetric encryption</code> - Uses different keys to encrypt and decrypt.</li>\n<li><code>Symmetric encryption</code> - Uses the same key to encrypt and decrypt</li>\n<li><code>Brute force</code> - Attacking cryptography by trying every different password or every different key</li>\n<li><code>Cryptanalysis</code> - Attacking cryptography by finding a weakness in the underlying maths</li>\n</ul>\n<p>Alice and Bob - Used to represent 2 people who generally want to communicate. They’re named Alice and Bob because this gives them the initials A and B. <a href=\"https://en.wikipedia.org/wiki/Alice_and_Bob\">https://en.wikipedia.org/wiki/Alice_and_Bob</a> for more information, as these extend through the alphabet to represent many different people involved in communication.</p>\n<p><strong>WARNING:</strong> This room is very theory heavy. Cryptography is a big topic, and this room is designed to just scratch the surface.</p>\n<h2 id=\"Questions-and-Answers-in-the-Task\"><a href=\"#Questions-and-Answers-in-the-Task\" class=\"headerlink\" title=\"Questions and Answers in the Task\"></a>Questions and Answers in the Task</h2><ol>\n<li>Are SSH keys protected with a passphrase or a password?<br>Answer: <code>Passphrase</code></li>\n</ol>\n<h1 id=\"TASK-3-Why-Encryption-is-important\"><a href=\"#TASK-3-Why-Encryption-is-important\" class=\"headerlink\" title=\"TASK 3 - Why Encryption is important ?\"></a>TASK 3 - Why Encryption is important ?</h1><p>Cryptography is used to protect confidentiality, ensure integrity, ensure authenticity. You use cryptography every day most likely, and you’re almost certainly reading this now over an encrypted connection.<br>When logging into TryHackMe, your credentials were sent to the server. These were encrypted, otherwise someone would be able to capture them by snooping on your connection.<br>When you connect to SSH, your client and the server establish an encrypted tunnel so that no one can snoop on your session.<br>When you connect to your bank, there’s a certificate that uses cryptography to prove that it is actually your bank rather than a hacker.<br>When you download a file, how do you check if it downloaded right? You can use cryptography here to verify a checksum of the data.<br>You rarely have to interact directly with cryptography, but it silently protects almost everything you do digitally.</p>\n<p>Whenever sensitive user data needs to be stored, it should be encrypted. Standards like <strong>PCI-DSS</strong> state that the data should be encrypted both at rest (in storage) AND while being transmitted. If you’re handling payment card details, you need to comply with these PCI regulations. Medical data has similar standards. With legislation like GDPR and California’s data protection, data breaches are extremely costly and dangerous to you as either a consumer or a business.</p>\n<p><strong>DO NOT</strong> encrypt passwords unless you’re doing something like a password manager. Passwords should not be stored in plaintext, and you should use hashing to manage them safely.</p>\n<h2 id=\"Questions-and-Answers-in-the-task\"><a href=\"#Questions-and-Answers-in-the-task\" class=\"headerlink\" title=\"Questions and Answers in the task\"></a>Questions and Answers in the task</h2><ol>\n<li>What Does SSH Stands For ?<br>Answer: <code>Secure Shell</code></li>\n<li>How to Webservers prove their Identity?<br>Answer: <code>Certificates</code></li>\n<li>What is the main set of standards you need to comply with if you store or process payment card details?<br>Answer: <code>PCI-DSS</code></li>\n</ol>\n<h1 id=\"TASK-4-crucial-Crypto-Maths\"><a href=\"#TASK-4-crucial-Crypto-Maths\" class=\"headerlink\" title=\"TASK 4 - crucial Crypto Maths\"></a>TASK 4 - crucial Crypto Maths</h1><p>There’s a little bit of math(s) that comes up relatively often in cryptography. The Modulo operator. Pretty much every programming language implements this operator, or has it available through a library. When you need to work with large numbers, use a programming language. Python is good for this as integers are unlimited in size, and you can easily get an interpreter.</p>\n<p>When learning division for the first time, you were probably taught to use remainders in your answer. X % Y is the remainder when X is divided by Y.</p>\n<p><strong>Examples</strong></p>\n<ul>\n<li>25 % 5 &#x3D; 0 (5*5 &#x3D; 25 so it divides exactly with no remainder)</li>\n<li>23 % 6 &#x3D; 5 (23 does not divide evenly by 6, there would be a remainder of 5)<br>An important thing to remember about modulo is that it’s not reversible. If I gave you an equation: x % 5 &#x3D; 4, there are infinite values of x that will be valid.</li>\n</ul>\n<h2 id=\"Questions-and-Answers-in-the-Task-1\"><a href=\"#Questions-and-Answers-in-the-Task-1\" class=\"headerlink\" title=\"Questions and Answers in the Task\"></a>Questions and Answers in the Task</h2><ol>\n<li>What’s 30 % 5?<br>Answer : 0 </li>\n<li>What’s 25 % 7?<br>Answer: 4</li>\n<li>What’s 118613842 % 9091?<br>Answer: 3565</li>\n</ol>\n<h1 id=\"TASK-5-Types-of-Encryption\"><a href=\"#TASK-5-Types-of-Encryption\" class=\"headerlink\" title=\"TASK 5 - Types of Encryption\"></a>TASK 5 - Types of Encryption</h1><p>The two main categories of Encryption are <code>symmetric</code> and <code>symmetric</code>.</p>\n<p><strong>Symmetric encryption</strong> uses the same key to encrypt and decrypt the data. Examples of Symmetric encryption are DES (Broken) and AES. These algorithms tend to be faster than asymmetric cryptography, and use smaller keys (128 or 256 bit keys are common for AES, DES keys are 56 bits long).</p>\n<p><strong>Asymmetric encryption</strong> uses a pair of keys, one to encrypt and the other in the pair to decrypt. Examples are RSA and Elliptic Curve Cryptography. Normally these keys are referred to as a public key and a private key. Data encrypted with the private key can be decrypted with the public key, and vice versa. Your private key needs to be kept private, hence the name. Asymmetric encryption tends to be slower and uses larger keys, for example RSA typically uses 2048 to 4096 bit keys.</p>\n<p>RSA and Elliptic Curve cryptography are based around different mathematically difficult (intractable) problems, which give them their strength. More about RSA later.</p>\n<h2 id=\"Questions-and-Answers-in-the-task-1\"><a href=\"#Questions-and-Answers-in-the-task-1\" class=\"headerlink\" title=\"Questions and Answers in the task\"></a>Questions and Answers in the task</h2><ol>\n<li>Should you trust DES? Yea&#x2F;Nay<br>Answer: <code>Nay</code></li>\n<li>What was the result of the attempt to make DES more secure so that it could be used for longer?<br>Answer: <code>Triple DES</code></li>\n<li>Is it ok to share your public key? Yea&#x2F;Nay<br>Answer: <code>Yea</code></li>\n</ol>\n<h1 id=\"Task-6-RSA-Rivest-Shamir-Adleman\"><a href=\"#Task-6-RSA-Rivest-Shamir-Adleman\" class=\"headerlink\" title=\"Task 6 - RSA - Rivest Shamir Adleman\"></a>Task 6 - RSA - Rivest Shamir Adleman</h1><p><strong>The math(s) side</strong><br>RSA is based on the mathematically difficult problem of working out the factors of a large number. It’s very quick to multiply two prime numbers together, say 17*23 &#x3D; 391, but it’s quite difficult to work out what two prime numbers multiply together to make 14351 (113x127 for reference).</p>\n<p><strong>The attacking side</strong><br>The maths behind RSA seems to come up relatively often in CTFs, normally requiring you to calculate variables or break some encryption based on them. The wikipedia page for RSA seems complicated at first, but will give you almost all of the information you need in order to complete challenges.</p>\n<p>There are some excellent tools for defeating RSA challenges in CTFs, and my personal favorite is <a href=\"https://github.com/Ganapati/RsaCtfTool\">https://github.com/Ganapati/RsaCtfTool</a> which has worked very well for me. I’ve also had some success with <a href=\"https://github.com/ius/rsatool\">https://github.com/ius/rsatool</a>.</p>\n<p>The key variables that you need to know about for RSA in CTFs are p, q, m, n, e, d, and c.</p>\n<p>“p” and “q” are large prime numbers, “n” is the product of p and q.</p>\n<ul>\n<li><p>The public key is n and e, the private key is n and d.</p>\n</li>\n<li><p>“m” is used to represent the message (in plaintext) and “c” represents the ciphertext (encrypted text).</p>\n</li>\n</ul>\n<p><strong>CTFs involving RSA</strong><br>Crypto CTF challenges often present you with a set of these values, and you need to break the encryption and decrypt a message to retrieve the flag.</p>\n<p>There’s a lot more maths to RSA, and it gets quite complicated fairly quickly. If you want to learn the maths behind it, I recommend reading MuirlandOracle’s blog post here: <a href=\"https://muirlandoracle.co.uk/2020/01/29/rsa-encryption/\">https://muirlandoracle.co.uk/2020/01/29/rsa-encryption/</a>.</p>\n<h2 id=\"Questions-and-Answers-of-the-Task\"><a href=\"#Questions-and-Answers-of-the-Task\" class=\"headerlink\" title=\"Questions and Answers of the Task\"></a>Questions and Answers of the Task</h2><ol>\n<li>p &#x3D; 4391, q &#x3D; 6659. What is n?<br>Answer:<br>Let’s Recall what is p , q &amp; n<br>p &amp; q are prime numbers and n is product of p&amp;q<br>so <code>n = p*q</code><br><code>n = 4391*6659</code><br><code>n = 29239669</code></li>\n</ol>\n<h1 id=\"TASK-7-Establishing-Keys-Using-Asymmetric-Cryptography\"><a href=\"#TASK-7-Establishing-Keys-Using-Asymmetric-Cryptography\" class=\"headerlink\" title=\"TASK 7 - Establishing Keys Using Asymmetric Cryptography\"></a>TASK 7 - Establishing Keys Using Asymmetric Cryptography</h1><p>A very common use of asymmetric cryptography is exchanging keys for symmetric encryption.<br>Asymmetric encryption tends to be slower, so for things like HTTPS symmetric encryption is better.<br>But the question is, how do you agree a key with the server without transmitting the key for people snooping to see?</p>\n<p><strong>Metaphor time</strong><br>Imagine you have a secret code, and instructions for how to use the secret code. If you want to send your friend the instructions without anyone else being able to read it, what you could do is ask your friend for a lock.</p>\n<p>Only they have the key for this lock, and we’ll assume you have an indestructible box that you can lock with it.<br>If you send the instructions in a locked box to your friend, they can unlock it once it reaches them and read the instructions.<br>After that, you can communicate in the secret code without risk of people snooping.<br>In this metaphor, the secret code represents a symmetric encryption key, the lock represents the server’s public key, and the key represents the server’s private key.<br>You’ve only used asymmetric cryptography once, so it’s fast, and you can now communicate privately with symmetric encryption.</p>\n<p><strong>The Real World</strong><br>In reality, you need a little more cryptography to verify the person you’re talking to is who they say they are, which is done using digital signatures and certificates. You can find a lot more detail on how HTTPS (one example where you need to exchange keys) really works from this excellent blog post. <a href=\"https://robertheaton.com/2014/03/27/how-does-https-actually-work/\">https://robertheaton.com/2014/03/27/how-does-https-actually-work/</a></p>\n<h1 id=\"TASK-8-Digital-Signatures-and-Certificates\"><a href=\"#TASK-8-Digital-Signatures-and-Certificates\" class=\"headerlink\" title=\"TASK 8 - Digital Signatures and Certificates\"></a>TASK 8 - Digital Signatures and Certificates</h1><p><strong>What’s a Digital Signature?</strong><br>Digital signatures are a way to prove the authenticity of files, to prove who created or modified them. Using asymmetric cryptography, you produce a signature with your private key and it can be verified using your public key. As only you should have access to your private key, this proves you signed the file. Digital signatures and physical signatures have the same value in the UK, legally.</p>\n<p>The simplest form of digital signature would be encrypting the document with your private key, and then if someone wanted to verify this signature they would decrypt it with your public key and check if the files match.</p>\n<p><strong>Certificates - Prove who you are!</strong><br>Certificates are also a key use of public key cryptography, linked to digital signatures. A common place where they’re used is for HTTPS. How does your web browser know that the server you’re talking to is the real tryhackme.com?</p>\n<p>The answer is certificates. The web server has a certificate that says it is the real tryhackme.com. The certificates have a chain of trust, starting with a root CA (certificate authority). Root CAs are automatically trusted by your device, OS, or browser from install. Certs below that are trusted because the Root CAs say they trust that organisation. Certificates below that are trusted because the organisation is trusted by the Root CA and so on. There are long chains of trust. Again, this blog post explains this much better than I can. <a href=\"https://robertheaton.com/2014/03/27/how-does-https-actually-work/\">https://robertheaton.com/2014/03/27/how-does-https-actually-work/</a></p>\n<p>You can get your own HTTPS certificates for domains you own using Let’s Encrypt for free. If you run a website, it’s worth setting it up.</p>\n<h2 id=\"Questions-and-Answers-of-the-Taks\"><a href=\"#Questions-and-Answers-of-the-Taks\" class=\"headerlink\" title=\"Questions and Answers of the Taks\"></a>Questions and Answers of the Taks</h2><ol>\n<li>Who is TryHackMe’s HTTPS certificate issued by?<br>Answer:<br>you can check that using site setting which are generally showed in the address bar of your browser<br>clikc on <code>view certificate or lock icon</code> to view the details of the site<br><img src=\"https://i.imgur.com/Mjp3zK1.png\" alt=\"img\"><br>so answer is <strong><code>E1</code></strong></li>\n</ol>\n<h1 id=\"TASK-9-SSH-Authentication\"><a href=\"#TASK-9-SSH-Authentication\" class=\"headerlink\" title=\"TASK 9 - SSH Authentication\"></a>TASK 9 - SSH Authentication</h1><p><strong>Encryption and SSH authentication</strong><br>By default, SSH is authenticated using usernames and passwords in the same way that you would log in to the physical machine.</p>\n<p>At some point, you’re almost certain to hit a machine that has SSH configured with key authentication instead. This uses public and private keys to prove that the client is a valid and authorised user on the server. By default, SSH keys are RSA keys. You can choose which algorithm to generate, and&#x2F;or add a passphrase to encrypt the SSH key. ssh-keygen is the program used to generate pairs of keys most of the time.</p>\n<p><strong>SSH Private Keys</strong><br>You should treat your private SSH keys like passwords. Don’t share them, they’re called private keys for a reason. If someone has your private key, they can use it to log in to servers that will accept it unless the key is encrypted.</p>\n<p>It’s very important to mention that the passphrase to decrypt the key isn’t used to identify you to the server at all, all it does is decrypt the SSH key. The passphrase is never transmitted, and never leaves your system.</p>\n<p>Using tools like John the Ripper, you can attack an encrypted SSH key to attempt to find the passphrase, which highlights the importance of using a secure passphrase and keeping your private key private.</p>\n<p>When generating an SSH key to log in to a remote machine, you should generate the keys on your machine and then copy the public key over as this means the private key never exists on the target machine. For temporary keys generated for access to CTF boxes, this doesn’t matter as much.</p>\n<p><strong>How do I use these keys?</strong><br>The <code>~/.ssh</code> folder is the default place to store these keys for OpenSSH. The authorized_keys (note the US English spelling) file in this directory holds public keys that are allowed to access the server if key authentication is enabled. By default on many distros, key authentication is enabled as it is more secure than using a password to authenticate. Normally for the root user, only key authentication is enabled.</p>\n<p>In order to use a private SSH key, the permissions must be set up correctly otherwise your SSH client will ignore the file with a warning. Only the owner should be able to read or write to the private key (600 or stricter). ssh -i keyNameGoesHere user@host is how you specify a key for the standard Linux OpenSSH client.</p>\n<p><strong>Using SSH keys to get a better shell</strong><br>SSH keys are an excellent way to “upgrade” a reverse shell, assuming the user has login enabled (www-data normally does not, but regular users and root will). Leaving an SSH key in authorized_keys on a box can be a useful backdoor, and you don’t need to deal with any of the issues of unstabilised reverse shells like Control-C or lack of tab completion.<br><strong>Download the task files from <a href=\"https://drive.google.com/file/d/1N1_0bzz0mLZMvt4_nzTlnF40ZYfaZNtS/view?usp=sharing\">here</a></strong></p>\n<h2 id=\"Questions-and-answers-in-the-task\"><a href=\"#Questions-and-answers-in-the-task\" class=\"headerlink\" title=\"Questions and answers in the task\"></a>Questions and answers in the task</h2><ol>\n<li>What algorithm does the key use?<br>Answer:<br>By looking at the file name we can say it uses <code>rsa</code> algorithm</li>\n<li>Crack the password with John The Ripper and rockyou, what’s the passphrase for the key?<br>Answer:</li>\n</ol>\n<ul>\n<li>we can crack the password &#x2F; passphrase of the key using John</li>\n<li>First we need extract the hash of the file by using:<br><code>ssh2john id_rsa_1593558668558.id_rsa &gt; ssh_key.txt</code></li>\n<li>Then we need to crack the hash to find passphrase by using<br><code>john --wordlist=/usr/share/wordlists/rockyou.txt ssh_key.txt</code><br> output:<br> <img src=\"https://i.imgur.com/Aaw8W3y.png\" alt=\"W\"><br> So passphrase for the key is <code>delicious</code></li>\n</ul>\n<h1 id=\"TASK-10-Explaining-Diffie-Hellman-Key-Exchange\"><a href=\"#TASK-10-Explaining-Diffie-Hellman-Key-Exchange\" class=\"headerlink\" title=\"TASK 10 - Explaining Diffie Hellman Key Exchange\"></a>TASK 10 - Explaining Diffie Hellman Key Exchange</h1><p>**<strong>What is Key Exchange?</strong><br>Key exchange allows 2 people&#x2F;parties to establish a set of common cryptographic keys without an observer being able to get these keys. Generally, to establish common symmetric keys.</p>\n<p><strong>How does Diffie Hellman Key Exchange work?</strong><br>Alice and Bob want to talk securely. They want to establish a common key, so they can use symmetric cryptography, but they don’t want to use key exchange with asymmetric cryptography. This is where DH Key Exchange comes in.</p>\n<p>Alice and Bob both have secrets that they generate, let’s call these A and B. They also have some common material that’s public, let’s call this C.</p>\n<p>We need to make some assumptions. Firstly, whenever we combine secrets&#x2F;material it’s impossible or very very difficult to separate. Secondly, the order that they’re combined in doesn’t matter.</p>\n<p>Alice and Bob will combine their secrets with the common material, and form AC and BC. They will then send these to each other, and combine that with their secrets to form two identical keys, both ABC. Now they can use this key to communicate.</p>\n<p><strong>Extra Resources</strong><br>An excellent video if you want a visual explanation is available here. <a href=\"https://www.youtube.com/watch?v=NmM9HA2MQGI\">https://www.youtube.com/watch?v=NmM9HA2MQGI</a></p>\n<p>DH Key Exchange is often used alongside RSA public key cryptography, to prove the identity of the person you’re talking to with digital signing. This prevents someone from attacking the connection with a man-in-the-middle attack by pretending to be Bob.</p>\n<h1 id=\"TASK-11-PGP-GPG-and-AES\"><a href=\"#TASK-11-PGP-GPG-and-AES\" class=\"headerlink\" title=\"TASK 11 - PGP, GPG and AES\"></a>TASK 11 - PGP, GPG and AES</h1><p><strong>What is PGP?</strong><br>PGP stands for Pretty Good Privacy. It’s a software that implements encryption for encrypting files, performing digital signing and more.</p>\n<p><strong>What is GPG?</strong><br>GnuPG or GPG is an Open Source implementation of PGP from the GNU project. You may need to use GPG to decrypt files in CTFs. With PGP&#x2F;GPG, private keys can be protected with passphrases in a similar way to SSH private keys. If the key is passphrase protected, you can attempt to crack this passphrase using John The Ripper and gpg2john. The key provided in this task is not protected with a passphrase.<br>The man page for GPG can be found online here.</p>\n<p><strong>What about AES?</strong><br>AES, sometimes called Rijndael after its creators, stands for Advanced Encryption Standard. It was a replacement for DES which had short keys and other cryptographic flaws.</p>\n<p>AES and DES both operate on blocks of data (a block is a fixed size series of bits).</p>\n<p>AES is complicated to explain, and doesn’t seem to come up as often. If you’d like to learn how it works, here’s an excellent video from Computerphile <a href=\"https://www.youtube.com/watch?v=O4xNJsjtN6E\">https://www.youtube.com/watch?v=O4xNJsjtN6E</a></p>\n<p><strong>Download the Task Files From <a href=\"https://drive.google.com/file/d/1MqSiPv6EPLOV4x8uYkWgtVRgh9Fisfuk/view?usp=sharing\">Here</a></strong></p>\n<h2 id=\"Questions-and-Answers-of-the-Task-1\"><a href=\"#Questions-and-Answers-of-the-Task-1\" class=\"headerlink\" title=\"Questions and Answers of the Task\"></a>Questions and Answers of the Task</h2><ol>\n<li>You have the private key, and a file encrypted with the public key. Decrypt the file. What’s the secret word?<br>Answer:</li>\n</ol>\n<ul>\n<li>we can decrypt the message by using <code>gpg</code> utility in linux</li>\n<li>first we need to import the key using<br><code>gpg --import tryhackme.key</code></li>\n<li>Now we can directly decrypt the message by using<br><code>gpg message.gpg</code></li>\n<li>Let’s see the content of the message using <code>cat</code><br><code>cat message</code><br>OUTPUT:<br><img src=\"https://i.imgur.com/yIWsicC.png\" alt=\"i\"><br>so secret word is <code>pineapple</code></li>\n</ul>\n<h1 id=\"Task-12-The-Future-Quantum-Computers-and-Encryption\"><a href=\"#Task-12-The-Future-Quantum-Computers-and-Encryption\" class=\"headerlink\" title=\"Task 12 The Future - Quantum Computers and Encryption\"></a>Task 12 The Future - Quantum Computers and Encryption</h1><p>Quantum computers will soon be a problem for many types of encryption.</p>\n<p><strong>Asymmetric and Quantum</strong><br>While it’s unlikely we’ll have sufficiently powerful quantum computers until around 2030, once these exist encryption that uses RSA or Elliptical Curve Cryptography will be very fast to break. This is because quantum computers can very efficiently solve the mathematical problems that these algorithms rely on for their strength.</p>\n<p><strong>AES&#x2F;DES and Quantum</strong><br>AES with 128 bit keys is also likely to be broken by quantum computers in the near future, but 256 bit AES can’t be broken as easily. Triple DES is also vulnerable to attacks from quantum computers.</p>\n<p><strong>Current Recommendations</strong><br>The NSA recommends using RSA-3072 or better for asymmetric encryption and AES-256 or better for symmetric encryption. There are several competitions currently running for quantum safe cryptographic algorithms, and it’s likely that we will have a new encryption standard before quantum computers become a threat to RSA and AES.</p>\n<p><strong>Learn More about Quantum Computers and Cryptography</strong><br>If you’d like to learn more about this, NIST has resources that detail what the issues with current encryption is and the currently proposed solutions for these. <a href=\"https://doi.org/10.6028/NIST.IR.8105\">https://doi.org/10.6028/NIST.IR.8105</a></p>\n<p>I also recommend the book <code>&quot;Cryptography Apocalypse&quot;</code> By Roger A. Grimes, as this was my introduction to quantum computing and quantum safe cryptography.</p>\n<p><strong>Thank You</strong> 💌<br><strong>Author:</strong> <code>Satvik Shetty</code>🧑‍💻<br><strong>See you again in another writeup</strong></p>\n","feature":false,"text":"Hello Hackers 🚀Today we are gonna walkthrough a new room on Try Hack Me called “...","permalink":"/post/Encryption-101","photos":[],"count_time":{"symbolsCount":"20k","symbolsTime":"18 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":11,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":11,"path":"api/categories/cybersecurity/THM.json"},{"name":"cryptography","slug":"cybersecurity/THM/cryptography","count":2,"path":"api/categories/cybersecurity/THM/cryptography.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":11,"path":"api/tags/tryhackme.json"},{"name":"cryptography","slug":"cryptography","count":2,"path":"api/tags/cryptography.json"},{"name":"hashing","slug":"hashing","count":2,"path":"api/tags/hashing.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-1-What-will-this-room-cover\"><span class=\"toc-text\">TASK 1 - What will this room cover?</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-2-Key-Terms\"><span class=\"toc-text\">TASK 2 - Key Terms</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task\"><span class=\"toc-text\">Questions and Answers in the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-3-Why-Encryption-is-important\"><span class=\"toc-text\">TASK 3 - Why Encryption is important ?</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-task\"><span class=\"toc-text\">Questions and Answers in the task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-4-crucial-Crypto-Maths\"><span class=\"toc-text\">TASK 4 - crucial Crypto Maths</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task-1\"><span class=\"toc-text\">Questions and Answers in the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-5-Types-of-Encryption\"><span class=\"toc-text\">TASK 5 - Types of Encryption</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-task-1\"><span class=\"toc-text\">Questions and Answers in the task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#Task-6-RSA-Rivest-Shamir-Adleman\"><span class=\"toc-text\">Task 6 - RSA - Rivest Shamir Adleman</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-of-the-Task\"><span class=\"toc-text\">Questions and Answers of the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-7-Establishing-Keys-Using-Asymmetric-Cryptography\"><span class=\"toc-text\">TASK 7 - Establishing Keys Using Asymmetric Cryptography</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-8-Digital-Signatures-and-Certificates\"><span class=\"toc-text\">TASK 8 - Digital Signatures and Certificates</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-of-the-Taks\"><span class=\"toc-text\">Questions and Answers of the Taks</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-9-SSH-Authentication\"><span class=\"toc-text\">TASK 9 - SSH Authentication</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-answers-in-the-task\"><span class=\"toc-text\">Questions and answers in the task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-10-Explaining-Diffie-Hellman-Key-Exchange\"><span class=\"toc-text\">TASK 10 - Explaining Diffie Hellman Key Exchange</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-11-PGP-GPG-and-AES\"><span class=\"toc-text\">TASK 11 - PGP, GPG and AES</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-of-the-Task-1\"><span class=\"toc-text\">Questions and Answers of the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#Task-12-The-Future-Quantum-Computers-and-Encryption\"><span class=\"toc-text\">Task 12 The Future - Quantum Computers and Encryption</span></a></li></ol>","author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"mapped":true,"hidden":false,"prev_post":{"title":"DNS in Detail - THM","uid":"b79812bf9f9c79ac4e4543b225fa1821","slug":"DNS-in-Detail","date":"2024-05-22T17:28:57.000Z","updated":"2024-05-23T09:32:59.159Z","comments":true,"path":"api/articles/DNS-in-Detail.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/59ce45d7405858110cb10b5c04eabb4c.png","text":"DNS in DetailTASK - 1 What is DNS?What is DNS?DNS (Domain Name System) provides ...","permalink":"/post/DNS-in-Detail","photos":[],"count_time":{"symbolsCount":"7.3k","symbolsTime":"7 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":11,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":11,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":5,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":11,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":5,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}}},"next_post":{"title":"John The Ripper - THM Walkthrough","uid":"5f7b8ef4b9940ed8e2c482b3c33809b3","slug":"John-The-Ripper","date":"2024-05-20T11:12:16.000Z","updated":"2024-05-20T19:14:59.555Z","comments":true,"path":"api/articles/John-The-Ripper.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/00b6a8786d69f4bd3f4aa2683411421e.jpeg","text":"Hello Hackers 🚀Today we will be solving the challenges in John The Ripper room o...","permalink":"/post/John-The-Ripper","photos":[],"count_time":{"symbolsCount":"31k","symbolsTime":"28 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":11,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":11,"path":"api/categories/cybersecurity/THM.json"},{"name":"cryptography","slug":"cybersecurity/THM/cryptography","count":2,"path":"api/categories/cybersecurity/THM/cryptography.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":11,"path":"api/tags/tryhackme.json"},{"name":"cryptography","slug":"cryptography","count":2,"path":"api/tags/cryptography.json"},{"name":"hashing","slug":"hashing","count":2,"path":"api/tags/hashing.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}}}}