{"title":"Walking an Application - THM","uid":"3f7217341e6a6154d773e1a5d0dd33e9","slug":"Walking-an-Application-THM","date":"2024-05-25T09:35:07.000Z","updated":"2024-05-26T18:05:46.206Z","comments":true,"path":"api/articles/Walking-an-Application-THM.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/6c8d2a41e835c68b049773bb4c30d5d6.svg","content":"<p>Welcome to Another writeup guys 💌<br>Today we will be walking through another room called as <code>&quot;Walking an Application&quot;</code> which is a part of <code>&quot;Web Fundamentals&quot;</code> path on TryHackMe<br>you can find all rooms of web fundamentals in the <code>&quot;WEB&quot;</code> category in our Blog<br>Let’s start solving the challenges Ahead ! 🚀</p>\n<h1 id=\"TASK-1-Walking-an-Application\"><a href=\"#TASK-1-Walking-an-Application\" class=\"headerlink\" title=\"TASK 1 - Walking an Application\"></a>TASK 1 - Walking an Application</h1><p>In this room you will learn how to manually review a web application for security issues using only the in-built tools in your browser. More often than not, automated security tools and scripts will miss many potential vulnerabilities and useful information.</p>\n<p>Here is a short breakdown of the in-built browser tools you will use throughout this room:</p>\n<p><strong>View Source</strong> - Use your browser to view the human-readable source code of a website.<br><strong>Inspector</strong> - Learn how to inspect page elements and make changes to view usually blocked content.<br><strong>Debugger</strong> - Inspect and control the flow of a page’s JavaScript<br><strong>Network</strong> - See all the network requests a page makes.<br>Start the virtual machine on this task, wait 2 minutes, and visit the following URL: <a href=\"https://lab_web_url.p.thmlabs.com/\">https://LAB_WEB_URL.p.thmlabs.com</a> (this URL will update 2 minutes from when you start the machine)<br><strong>Now start the machine and move on next task</strong></p>\n<h1 id=\"TASK-2-Exploring-the-website\"><a href=\"#TASK-2-Exploring-the-website\" class=\"headerlink\" title=\"TASK 2 - Exploring the website\"></a>TASK 2 - Exploring the website</h1><p>As a penetration tester, your role when reviewing a website or web application is to discover features that could potentially be vulnerable and attempt to exploit them to assess whether or not they are. These features are usually parts of the website that require some interactivity with the user.</p>\n<p>Finding interactive portions of the website can be as easy as spotting a login form to manually reviewing the website’s JavaScript. An excellent place to start is just with your browser exploring the website and noting down the individual pages&#x2F;areas&#x2F;features with a summary for each one.</p>\n<p>An example site review for the Acme IT Support website would look something like this:</p>\n<table>\n<thead>\n<tr>\n<th>Feature</th>\n<th>URL</th>\n<th>Summary</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Home Page</td>\n<td>&#x2F;</td>\n<td>This page contains a summary of what Acme IT Support does with a company photo of their staff.</td>\n</tr>\n<tr>\n<td>Latest News</td>\n<td>&#x2F;news</td>\n<td>This page contains a list of recently published news articles by the company, and each news article has a link with an id number, i.e. &#x2F;news&#x2F;article?id&#x3D;1.</td>\n</tr>\n<tr>\n<td>News Article</td>\n<td>&#x2F;news&#x2F;article?id&#x3D;1</td>\n<td>Displays the individual news article. Some articles seem to be blocked and reserved for premium customers only.</td>\n</tr>\n<tr>\n<td>Contact Page</td>\n<td>&#x2F;contact</td>\n<td>This page contains a form for customers to contact the company. It contains name, email and message input fields and a send button.</td>\n</tr>\n<tr>\n<td>Customers</td>\n<td>&#x2F;customers</td>\n<td>This link redirects to &#x2F;customers&#x2F;login.</td>\n</tr>\n<tr>\n<td>Customer Login</td>\n<td>&#x2F;customers&#x2F;login</td>\n<td>This page contains a login form with username and password fields.</td>\n</tr>\n<tr>\n<td>Customer Signup</td>\n<td>&#x2F;customers&#x2F;signup</td>\n<td>This page contains a user-signup form that consists of a username, email, password and password confirmation input fields.</td>\n</tr>\n<tr>\n<td>Customer Reset Password</td>\n<td>&#x2F;customers&#x2F;reset</td>\n<td>Password reset form with an email address input field.</td>\n</tr>\n<tr>\n<td>Customer Dashboard</td>\n<td>&#x2F;customers</td>\n<td>This page contains a list of the user’s tickets submitted to the IT support company and a “Create Ticket” button.</td>\n</tr>\n<tr>\n<td>Create Ticket</td>\n<td>&#x2F;customers&#x2F;ticket&#x2F;new</td>\n<td>This page contains a form with a textbox for entering the IT issue and a file upload option to create an IT support ticket.</td>\n</tr>\n<tr>\n<td>Customer Account</td>\n<td>&#x2F;customers&#x2F;account</td>\n<td>This page allows the user to edit their username, email and password.</td>\n</tr>\n<tr>\n<td>Customer Logout</td>\n<td>&#x2F;customers&#x2F;logout</td>\n<td>This link logs the user out of the customer area.</td>\n</tr>\n<tr>\n<td>We will start taking a deeper look into some of the pages we have discovered in the next task</td>\n<td></td>\n<td></td>\n</tr>\n</tbody></table>\n<p><strong>Understand the website structure by looking the table above and move to the next challenge</strong></p>\n<h1 id=\"TASK-3-Viewing-the-page-source\"><a href=\"#TASK-3-Viewing-the-page-source\" class=\"headerlink\" title=\"TASK 3 - Viewing the page source\"></a>TASK 3 - Viewing the page source</h1><p>The page source is the human-readable code returned to our browser&#x2F;client from the web server each time we make a request.</p>\n<p>The returned code is made up of HTML ( HyperText Markup Language), CSS ( Cascading Style Sheets ) and JavaScript, and it’s what tells our browser what content to display, how to show it and adds an element of interactivity with JavaScript.</p>\n<p>For our purposes, viewing the page source can help us discover more information about the web application.</p>\n<p><strong>How do I view the Page Source?</strong><br>While viewing a website, you can right-click on the page, and you’ll see an option on the menu that says View Page Source.<br>Most browsers support putting view-source: in front of the URL for example, view-source:<a href=\"https://www.google.com/\">https://www.google.com/</a><br>In your browser menu, you’ll find an option to view the page source. This option can sometimes be in submenus such as developer tools or more tools.</p>\n<p><strong>Let’s view some Page Source!</strong><br>Try viewing the page source of the home page of the Acme IT Support website. Unfortunately, explaining everything you can see here is well out of the scope of this room, and you’ll need to look into website design&#x2F;development courses to understand it fully. What we can do, is pick out bits of information that are of importance to us.</p>\n<p>At the top of the page, you’ll notice some code starting with<br><code>&lt;!-- and ending with --&gt;</code> these are comments. Comments are messages left by the website developer, usually to explain something in the code to other programmers or even notes&#x2F;reminders for themselves. These comments don’t get displayed on the actual webpage. This comment describes how the homepage is temporary while a new one is in development. View the webpage in the comment to get your first flag.</p>\n<p>Links to different pages in HTML are written in anchor tags ( these are HTML elements that start with <code>&lt;a</code> ), and the link that you’ll be directed to is stored in the href attribute.</p>\n<p>For example, you’ll see the contact page link on line 31:</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5efe36fb68daf465530ca761/room-content/ccc306acf34d0c83ffd18f33da1a5994.png\" alt=\"i\"></p>\n<p>If you view further down the page source, there is a hidden link to a page starting with “secr”, view this link to get another flag. You obviously wouldn’t get a flag in a real-world situation, but you may discover some private area used by the business for storing company&#x2F;staff&#x2F;customer information.</p>\n<p>External files such as CSS, JavaScript and Images can be included using the HTML code. In this example, you’ll notice that these files are all stored in the same directory. If you view this directory in your web browser, there is a configuration error. What should be displayed is either a blank page or a 403 Forbidden page with an error stating you don’t have access to the directory. Instead, the directory listing feature has been enabled, which in fact, lists every file in the directory. Sometimes this isn’t an issue, and all the files in the directory are safe to be viewed by the public, but in some instances, backup files, source code or other confidential information could be stored here. In this instance, we get a flag in the flag.txt file.</p>\n<p>Many websites these days aren’t made from scratch and use what’s called a framework. A framework is a collection of premade code that easily allows a developer to include common features that a website would require, such as blogs, user management, form processing, and much more, saving the developers hours or days of development.</p>\n<p>Viewing the page source can often give us clues into whether a framework is in use and, if so, which framework and even what version. Knowing the framework and version can be a powerful find as there may be public vulnerabilities in the framework, and the website might not be using the most up to date version. At the bottom of the page, you’ll find a comment about the framework and version in use and a link to the framework’s website. Viewing the framework’s website, you’ll see that our website is, in fact, out of date. Read the update notice and use the information that you find to discover another flag.</p>\n<h2 id=\"Questions-and-Answers-of-the-task\"><a href=\"#Questions-and-Answers-of-the-task\" class=\"headerlink\" title=\"Questions and Answers of the task\"></a>Questions and Answers of the task</h2><p><strong>1. What is the flag from the HTML comment?</strong><br>Answer:</p>\n<ul>\n<li>Let’s open the site and view its source first</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/cmstpvqmzsbp8ecxtd4zl/h1.png?rlkey=27ev3riqbu0kwtf5vlhvqjooj&st=5321m2nq&dl=0\" alt=\"h1\"></p>\n<ul>\n<li>if we look at the comments in the source , it saying that the current home page is temporary and new page is developing at @new-home-beta</li>\n<li>so let’s go to the source of &#x2F;new-page-beta and look if it has anything for us</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/41xskeclg75suvors9y37/h2.png?rlkey=z4gdzkbv4jfo4115gxh8xqbl3&st=burj9o3b&dl=0\" alt=\"h2\"></p>\n<ul>\n<li>Oh yes Guys , Here’s our flag <code>THM&#123;HTML_COMMENTS_ARE_DANGEROUS&#125;</code></li>\n</ul>\n<p><strong>2. What is the flag from the secret link?</strong><br>Answer:</p>\n<ul>\n<li>Lets find out where that secret link is hiding </li>\n<li>for that we should look carefully at the source code of home page</li>\n<li>Lets do it</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/a2m55pl69aebvnyrg1fm2/h3.png?rlkey=111ki909b15tjf38cb83frsth&st=uhp249uh&dl=0\" alt=\"n3\"></p>\n<ul>\n<li>So there is something called secret-page . Lets check it out</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/hum1l6hv60nbe8gga8yr9/h4.png?rlkey=3d4khge04sjq6ei1pjo24r4z2&st=hb7r4o57&dl=0\" alt=\"h4\"></p>\n<ul>\n<li>Yayy ! We got it …</li>\n<li>so the answer is <code>THM&#123;NOT_A_SECRET_ANYMORE&#125;</code></li>\n</ul>\n<p><strong>3. What is the directory listing flag?</strong><br>Answer:</p>\n<ul>\n<li>if we look at the website structure , we can understand that all the files on the website in stored in <code>/assets</code> directory . so let’s go and check it out</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/ce77e5wf8omw8ewls6rhp/h5.png?rlkey=6c95ewkvbk6gl82q9y9761jln&st=pubouhln&dl=0\" alt=\"h5\"></p>\n<ul>\n<li>We have something interesting called <code>flag.txt</code> , open it</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/xvlr593auttri8ladoyo4/h6.png?rlkey=rn1o5hj5di2yukbntald21ib8&st=rpeoe3sm&dl=0\" alt=\"h6\"></p>\n<ul>\n<li>so the flag is : <code>THM&#123;INVALID_DIRECTORY_PERMISSIONS&#125;</code></li>\n</ul>\n<p><strong>4. What is the framework flag?</strong><br>Answer:</p>\n<ul>\n<li>if we look at the ending line of the source code which is comment <code>&lt;!--Page Generated in 0.04820 Seconds using the THM Framework v1.2 ( https://static-labs.tryhackme.cloud/sites/thm-web-framework )--&gt;</code></li>\n<li>so let’s go to that web url and look if there is anything interesting</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/d06pboqvb59692ijeu2jg/h7.png?rlkey=6txvumi3vpe47kv65b11ee1gb&st=x0bgr0jb&dl=0\" alt=\"h7\"></p>\n<ul>\n<li>we can find three pages there<ul>\n<li>Home - which is our actual homepage</li>\n<li>Changelog - which is about the latest changes in the site and things that are patched</li>\n<li>Documentation - Ofcourse you guys know what would be there inside it</li>\n</ul>\n</li>\n<li>So out of these , we can find something interest in changelog as it tells about the fixes and may reveal some important information about the current version of the page</li>\n<li>lets go to <code>change log</code> page and look if it has anything interesting for us</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/xql7xa3vm3elgbqu94iv8/h8.png?rlkey=ydwl5hz90pmtfqfmlrqeppsel&st=jvkq9pk1&dl=0\" alt=\"h8\"></p>\n<ul>\n<li>if we look at log <code>vserion 1.3</code> , we can understand that some potential information is storing in &#x2F;tmp.zip file in the web server</li>\n<li>so now will try to access that</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/7aunof0fyu5750h7blrdp/h9.png?rlkey=j7gb4524r20uztcy9ygterrj6&st=hbo3ghwk&dl=0\" alt=\"h9\"></p>\n<ul>\n<li>woah ! we got that tmp.zip file guys so let’s extract it and see the contents</li>\n<li>so guys there it is ! we got <code>flag.txt</code></li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/okc3fmz0kyymt681au86s/h10.png?rlkey=fzq0jwesuntvg3uxcl3qd6p3d&st=oqftjalq&dl=0\" alt=\"h10\"></p>\n<ul>\n<li>yay! The Flag is <code>THM&#123;KEEP_YOUR_SOFTWARE_UPDATED&#125;</code></li>\n</ul>\n<h1 id=\"TASK-4-Developer-Tools-Inspector\"><a href=\"#TASK-4-Developer-Tools-Inspector\" class=\"headerlink\" title=\"TASK 4 - Developer Tools - Inspector\"></a>TASK 4 - Developer Tools - Inspector</h1><p><strong>Developer Tools</strong></p>\n<p>Every modern browser includes developer tools; this is a tool kit used to aid web developers in debugging web applications and gives you a peek under the hood of a website to see what is going on. As a pentester, we can leverage these tools to provide us with a much better understanding of the web application. We’re specifically focusing on three features of the developer tool kit, Inspector, Debugger and Network.</p>\n<p><strong>Opening Developer Tools</strong><br>The way to access developer tools is different for every browser. If you’re not sure how to access it, click the “View Site” button on the top right of this task to get instructions to how to access the tools for your browser.</p>\n<p><strong>Inspector</strong><br>The page source doesn’t always represent what’s shown on a webpage; this is because CSS, JavaScript and user interaction can change the content and style of the page, which means we need a way to view what’s been displayed in the browser window at this exact time. Element inspector assists us with this by providing us with a live representation of what is currently on the website.</p>\n<p>As well as viewing this live view, we can also edit and interact with the page elements, which is helpful for web developers to debug issues.</p>\n<p>On the Acme IT Support website, click into the news section, where you’ll see three news articles.</p>\n<p>The first two articles are readable, but the third has been blocked with a floating notice above the content stating you have to be a premium customer to view the article. These floating boxes blocking the page contents are often referred to as paywalls as they put up a metaphorical wall in front of the content you wish to see until you pay.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5efe36fb68daf465530ca761/room-content/96b49cec6712a47c4ea986d26c6b7451.png\" alt=\"img\"></p>\n<p>Right-clicking on the premium notice ( paywall ), you should be able to select the Inspect option from the menu, which opens the developer tools either on the bottom or right-hand side depending on your browser or preferences. You’ll now see the elements&#x2F;HTML that make up the website ( similar to the screenshots below ).</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5efe36fb68daf465530ca761/room-content/0e3f5c5c8dd02916d6fc2637461293a9.png\" alt=\"i\"></p>\n<p>(Click on the image to enlarge)</p>\n<p>Locate the <code>DIV</code> element with the class <code>premium-customer-blocker</code> and click on it. You’ll see all the CSS styles in the styles box that apply to this element, such as <code>margin-top: 60px</code> and <code>text-align: center</code>. The style we’re interested in is the <code>display: block</code>. If you click on the word block, you can type a value of your own choice. Try typing <strong><code>none</code></strong>, and this will make the box disappear, revealing the content underneath it and a flag. If the element didn’t have a display field, you could click below the last style and add in your own. Have a play with the element inspector, and you’ll see you can change any of the information on the website, including the content. Remember this is only edited on your browser window, and when you press refresh, everything will be back to normal.</p>\n<h2 id=\"Questions-and-Answers-in-the-task\"><a href=\"#Questions-and-Answers-in-the-task\" class=\"headerlink\" title=\"Questions and Answers in the task\"></a>Questions and Answers in the task</h2><p><strong>1. What is the flag behind the paywall?</strong><br>Answer:</p>\n<ul>\n<li>go to news page and click inspect on <em>paywall</em> block</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/p4nf72d9i567xyvjlx718/h11.png?rlkey=rn81rkhtt95y1mp2c1hccpuk9&st=utzx3cro&dl=0\" alt=\"h11\"></p>\n<p><img src=\"https://dl.dropbox.com/scl/fi/dvq0b0quxw1jhqq7nh7s3/h12.png?rlkey=cevqobz0kz66vw1gpvbbyjnnt&st=r2f35tio&dl=0\" alt=\"h12\"></p>\n<ul>\n<li>After changing the value to <code>none</code> . view the site again</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/h6jrg98w661ht4xbrn0g2/h13.png?rlkey=u3uy2l5i6sobh5so8bxpa84vu&st=ovrkhv6r&dl=0\" alt=\"h13\"></p>\n<ul>\n<li>Haha ! we got it <code>THM&#123;NOT_SO_HIDDEN&#125;</code></li>\n</ul>\n<h1 id=\"TASK-5-Developer-Tools-Debugger\"><a href=\"#TASK-5-Developer-Tools-Debugger\" class=\"headerlink\" title=\"TASK 5 - Developer Tools - Debugger\"></a>TASK 5 - Developer Tools - Debugger</h1><p><strong>Developer Tools - Debugger</strong></p>\n<p>This panel in the developer tools is intended for debugging JavaScript, and again is an excellent feature for web developers wanting to work out why something might not be working. But as penetration testers, it gives us the option of digging deep into the JavaScript code. In Firefox and Safari, this feature is called Debugger, but in Google Chrome, it’s called Sources.</p>\n<p>On the Acme IT Support website, click on the contact page, each time the page is loaded, you might notice a rapid flash of red on the screen. We’re going to use the Debugger to work out what this red flash is and if it contains anything interesting. Debugging a red dot wouldn’t be something you’d do in the real world as a penetration tester, but it does allow us to use this feature and get used to the Debugger.</p>\n<p>In both browsers, on the left-hand side, you see a list of all the resources the current webpage is using. If you click into the assets folder, you’ll see a file named flash.min.js. Clicking on this file displays the contents of the JavaScript file.</p>\n<p>Many times when viewing javascript files, you’ll notice that everything is on one line, which is because it has been minimised, which means all formatting ( tabs, spacing and newlines ) have been removed to make the file smaller. This file is no exception to this, and it has also been obfusticated, which makes it purposely difficult to read, so it can’t be copied as easily by other developers.</p>\n<p>We can return some of the formattings by using the “Pretty Print” option, which looks like two braces { } to make it a little more readable, although due to the obfustication, it’s still difficult to comprehend what is going on with the file. If you scroll to the bottom of the flash.min.js file, you’ll see the line:<code> flash[&#39;remove&#39;]();</code></p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5efe36fb68daf465530ca761/room-content/d76d0b263799865be55d6725cbeaf21b.png\" alt=\"i\"></p>\n<p>(Click on the image to enlarge)</p>\n<p>This little bit of JavaScript is what is removing the red popup from the page. We can utilise another feature of debugger called breakpoints. These are points in the code that we can force the browser to stop processing the JavaScript and pause the current execution.</p>\n<p>If you click the line number that contains the above code, you’ll notice it turns blue; you’ve now inserted a breakpoint on this line. Now try refreshing the page, and you’ll notice the red box stays on the page instead of disappearing, and it contains a flag.</p>\n<h2 id=\"Questions-and-Answers-in-the-Task\"><a href=\"#Questions-and-Answers-in-the-Task\" class=\"headerlink\" title=\"Questions and Answers in the Task\"></a>Questions and Answers in the Task</h2><p><strong>1. What is the flag in the red box?</strong><br>Answer:</p>\n<ul>\n<li>Goto contact page and open Debugger </li>\n<li>click on line no.110 and select the three options in the side bar as shown in the image below</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/p2xx81n9i27a717yr29f4/h15.png?rlkey=w4clat4a7w09hvylo3dgu0yh8&st=014c9a7f&dl=0\" alt=\"h15\"></p>\n<ul>\n<li>Now refresh the page</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/ad5uuw6na1agvamzeid0t/h16.png?rlkey=4fnpz1438lsvx8hpbzuu2toat&st=o0xt9882&dl=0\" alt=\"h16\"></p>\n<ul>\n<li>Flag <code>THM&#123;CATCH_ME_IF_YOU_CAN&#125;</code></li>\n</ul>\n<h1 id=\"TASK-6-Developer-Tools-Network\"><a href=\"#TASK-6-Developer-Tools-Network\" class=\"headerlink\" title=\"TASK 6 - Developer Tools - Network\"></a>TASK 6 - Developer Tools - Network</h1><p><strong>Developer Tools - Network</strong><br>The network tab on the developer tools can be used to keep track of every external request a webpage makes. If you click on the Network tab and then refresh the page, you’ll see all the files the page is requesting. </p>\n<p>Try doing this on the contact page; you can press the trash can icon to delete the list if it gets a bit overpopulated.</p>\n<p>With the network tab open, try filling in the contact form and pressing the Send Message button. You’ll notice an event in the network tab, and this is the form being submitted in the background using a method called AJAX. AJAX is a method for sending and receiving network data in a web application background without interfering by changing the current web page.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5efe36fb68daf465530ca761/room-content/9ec0890f159397547950ea1822994443.png\" alt=\"o\"></p>\n<p>Examine the new entry on the network tab that the contact form created and view the page the data was sent to in order to reveal a flag.</p>\n<h2 id=\"Questions-and-Answers-in-the-Task-1\"><a href=\"#Questions-and-Answers-in-the-Task-1\" class=\"headerlink\" title=\"Questions and Answers in the Task\"></a>Questions and Answers in the Task</h2><p><strong>1. What is the flag shown on the contact-msg network request?</strong><br>Answer:</p>\n<ul>\n<li>Go to contact page and click on inspect and then go to Network Tab</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/1xi9d4ex5eq91drqtqg8c/h17.png?rlkey=a9ijy55bm6eucn1pocln03jrf&st=fi1ea43o&dl=0\" alt=\"h17\"></p>\n<ul>\n<li>Now fill the form with random information and click on send message ( make sure you have network tab open)</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/7zwxr6uezpmrn3q4miqnl/h18.png?rlkey=3fns0ho3kfgwxwrfuw2givlpo&st=tdvkklnh&dl=0\" alt=\"h18\"></p>\n<ul>\n<li>Now you can observe some response in network tab </li>\n<li>click on it and in sidebar goto <code>Response</code> tab</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/ivbklcejvtzyp7u90q3zs/h19.png?rlkey=8rywry1uiv42twtvvxz76l09b&st=v7y5x0vv&dl=0\" alt=\"h19\"></p>\n<ul>\n<li>Flag: <code>THM&#123;GOT_AJAX_FLAG&#125;</code></li>\n</ul>\n<p>Thats it guys ! You havve succesfully completed the room 🥳<br><strong>Thank You</strong> 💌<br><strong>Author:</strong> <code>Satvik Shetty</code>🧑‍💻<br><strong>See you again in another writeup</strong></p>\n","feature":true,"text":"Welcome to Another writeup guys 💌Today we will be walking through another room c...","permalink":"/post/Walking-an-Application-THM","photos":[],"count_time":{"symbolsCount":"17k","symbolsTime":"16 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":11,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":11,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":5,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":11,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":5,"path":"api/tags/web.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-1-Walking-an-Application\"><span class=\"toc-text\">TASK 1 - Walking an Application</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-2-Exploring-the-website\"><span class=\"toc-text\">TASK 2 - Exploring the website</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-3-Viewing-the-page-source\"><span class=\"toc-text\">TASK 3 - Viewing the page source</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-of-the-task\"><span class=\"toc-text\">Questions and Answers of the task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-4-Developer-Tools-Inspector\"><span class=\"toc-text\">TASK 4 - Developer Tools - Inspector</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-task\"><span class=\"toc-text\">Questions and Answers in the task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-5-Developer-Tools-Debugger\"><span class=\"toc-text\">TASK 5 - Developer Tools - Debugger</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task\"><span class=\"toc-text\">Questions and Answers in the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-6-Developer-Tools-Network\"><span class=\"toc-text\">TASK 6 - Developer Tools - Network</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task-1\"><span class=\"toc-text\">Questions and Answers in the Task</span></a></li></ol></li></ol>","author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"mapped":true,"hidden":false,"prev_post":{"title":"Content Discovery - THM Walkthrough","uid":"ec2c0857db02e59b1fe7edb40ad2f3b4","slug":"Content-Discovery-THM-Walkthrough","date":"2024-05-26T18:17:07.000Z","updated":"2024-05-26T19:28:53.857Z","comments":true,"path":"api/articles/Content-Discovery-THM-Walkthrough.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/2f678b7457e828715a10b8bc02fd65b5.png","text":"Hello Hackers 💌Today we are gonna walkthrough a new room in Web Fundamentals cal...","permalink":"/post/Content-Discovery-THM-Walkthrough","photos":[],"count_time":{"symbolsCount":"7.1k","symbolsTime":"6 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":11,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":11,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":5,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":11,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":5,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"feature":true},"next_post":{"title":"How Websites Work - THM Walkthrough","uid":"04c3f082e63bec82336499ba808815fb","slug":"How-Websites-Work-THM-Walkthrough","date":"2024-05-23T09:28:53.000Z","updated":"2024-05-23T12:29:10.619Z","comments":true,"path":"api/articles/How-Websites-Work-THM-Walkthrough.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/4e3a3940e2a4ab1b058e2e199f2af0b4.svg","text":"Hello Hackers 💌Today we will be walking through a new room on tryhackme called H...","permalink":"/post/How-Websites-Work-THM-Walkthrough","photos":[],"count_time":{"symbolsCount":"8.6k","symbolsTime":"8 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":11,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":11,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":5,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":11,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":5,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"feature":true}}