{"posts":[{"title":"Beginner Resources 2024","text":"Online Tools and ResourcesIP and DNS Leak Testing ipleak.net diafygi.github.io/webrtc-ips dnsleaktest.com Tor Check 🧅 5deqglhxcoy3gbx6.onion tmkloc6vhxos3nde.onion SMS 📩 receive-sms-online.info receive-sms-now.com receivesmsonline.net Fake Identity 🙃 fakena.me names.igopaygo.com/people/fake_person fakenamegenerator.com Network Online Tools 🌐 yougetsignal.com dnswatch.info nirsoft.net/countryip tcpiputils.com bgp.he.net sockets.com/services.htm services.ce3c.be/ciprg coffer.com/mac_find Vulnerabilities Database 🎯 cve.mitre.org/cve cvedetails.com osvdb.org kb.cert.org/vuls secunia.com/community/advisories/search securityfocus.com/bid lwn.net/Vulnerabilities denimgroup.com/resources-threadfix vulnerability-lab.com secdocs.org nvd.nist.gov Exploits Database 💥 exploit-db.com intelligentexploit.com shodanhq.com packetstormsecurity.com","link":"/2024/05/16/Beginner-Resources-2024/"},{"title":"Basic Port Scan - THM","text":"Nmap Basic Port ScansINTRODUCTIONThe next step would be checking which ports are open and listening and which ports are closed. Therefore, in this room and the next one, we focus on port scanning and the different types of port scans used by nmap. This room explains: TCP connect port scan TCP SYN port scan UDP port scan Moreover, we discuss the different options to specify the ports, the scan rate, and the number of parallel probes. TASK - 2 TCP and UDP PORTSIn the same sense that an IP address specifies a host on a network among many others, a TCP port or UDP port is used to identify a network service running on that host. A server provides the network service, and it adheres to a specific network protocol. Examples include providing time, responding to DNS queries, and serving web pages. A port is usually linked to a service using that specific port number. For instance, an HTTP server would bind to TCP port 80 by default; moreover, if the HTTP server supports SSL/TLS, it would listen on TCP port 443. (TCP ports 80 and 443 are the default ports for HTTP and HTTPS; however, the webserver administrator might choose other port numbers if necessary.) Furthermore, no more than one service can listen on any TCP or UDP port (on the same IP address). At the risk of oversimplification, we can classify ports in two states: Open port indicates that there is some service listening on that port. Closed port indicates that there is no service listening on that port. However, in practical situations, we need to consider the impact of firewalls. For instance, a port might be open, but a firewall might be blocking the packets. Therefore, Nmap considers the following six states: Open: indicates that a service is listening on the specified port. Closed: indicates that no service is listening on the specified port, although the port is accessible. By accessible, we mean that it is reachable and is not blocked by a firewall or other security appliances/programs. Filtered: means that Nmap cannot determine if the port is open or closed because the port is not accessible. This state is usually due to a firewall preventing Nmap from reaching that port. Nmap’s packets may be blocked from reaching the port; alternatively, the responses are blocked from reaching Nmap’s host. Unfiltered: means that Nmap cannot determine if the port is open or closed, although the port is accessible. This state is encountered when using an ACK scan -sA. Open|Filtered: This means that Nmap cannot determine whether the port is open or filtered. Closed|Filtered: This means that Nmap cannot decide whether a port is closed or filtered. ANSWERS Which service uses UDP port 53 by default? Correct Answer: DNS Which service uses TCP port 22 by default? Correct Answer: SSH How many port states does Nmap consider? Correct Answer: 6 Which port state is the most interesting to discover as a pentester? Correct Answer: Open TASK 3 - TCP FLAGSNmap supports different types of TCP port scans. To understand the difference between these port scans, we need to review the TCP header. The TCP header is the first 24 bytes of a TCP segment. The following figure shows the TCP header as defined in RFC 793. This figure looks sophisticated at first; however, it is pretty simple to understand. In the first row, we have the source TCP port number and the destination port number. We can see that the port number is allocated 16 bits (2 bytes). In the second and third rows, we have the sequence number and the acknowledgment number. Each row has 32 bits (4 bytes) allocated, with six rows total, making up 24 bytes. In particular, we need to focus on the flags that Nmap can set or unset. We have highlighted the TCP flags in red. Setting a flag bit means setting its value to 1. From left to right, the TCP header flags are: URG: Urgent flag indicates that the urgent pointer filed is significant. The urgent pointer indicates that the incoming data is urgent, and that a TCP segment with the URG flag set is processed immediately without consideration of having to wait on previously sent TCP segments. ACK: Acknowledgment flag indicates that the acknowledgment number is significant. It is used to acknowledge the receipt of a TCP segment. PSH: Push flag asking TCP to pass the data to the application promptly. RST: Reset flag is used to reset the connection. Another device, such as a firewall, might send it to tear a TCP connection. This flag is also used when data is sent to a host and there is no service on the receiving end to answer. SYN: Synchronize flag is used to initiate a TCP 3-way handshake and synchronize sequence numbers with the other host. The sequence number should be set randomly during TCP connection establishment. FIN: The sender has no more data to send. ANSWERS What 3 letters represent the Reset flag? Correct Answer: RST Which flag needs to be set when you initiate a TCP connection (first packet of TCP 3-way handshake)? Correct Answer: SYN TASK 4 - TCP CONNECT SCANTCP connect scan works by completing the TCP 3-way handshake. In standard TCP connection establishment, the client sends a TCP packet with SYN flag set, and the server responds with SYN/ACK if the port is open; finally, the client completes the 3-way handshake by sending an ACK. We are interested in learning whether the TCP port is open, not establishing a TCP connection. Hence the connection is torn as soon as its state is confirmed by sending a RST/ACK. You can choose to run TCP connect scan using -sT. It is important to note that if you are not a privileged user (root or sudoer), a TCP connect scan is the only possible option to discover open TCP ports. Question: Launch the VM. Open the AttackBox and execute nmap -sT 10.10.23.101 via the terminal. A new service has been installed on this VM since our last scan. Which port number was closed in the scan above but is now open on this target VM? Answer: 110 Command: nmap -sT 10.10.23.101 New service: POP3 TASK 5 - TCP SYN SCANUnprivileged users are limited to connect scan. However, the default scan mode is SYN scan, and it requires a privileged (root or sudoer) user to run it. SYN scan does not need to complete the TCP 3-way handshake; instead, it tears down the connection once it receives a response from the server. Because we didn’t establish a TCP connection, this decreases the chances of the scan being logged. We can select this scan type by using the -sS option. Questions: What is the new open port? Correct Answer: 6667 What is Nmap’s guess of the service name? Correct Answer: irc Task 7: Fine-Tuning Scope and PerformanceYou can specify the ports you want to scan instead of the default 1000 ports. Specifying the ports is intuitive by now. Let’s see some examples: Port list: -p22,80,443 will scan ports 22, 80, and 443. Port range: -p1-1023 will scan all ports between 1 and 1023 inclusive, while -p20-25 will scan ports between 20 and 25 inclusive. You can request the scan of all ports by using -p-, which will scan all 65535 ports. If you want to scan the most common 100 ports, add -F. Using --top-ports 10 will check the ten most common ports. You can control the scan timing using -T&lt;0-5&gt;. -T0 is the slowest (paranoid), while -T5 is the fastest. According to the Nmap manual page, there are six templates: Paranoid (0) Sneaky (1) Polite (2) Normal (3) Aggressive (4) Insane (5) To avoid IDS alerts, you might consider -T0 or -T1. For instance, -T0 scans one port at a time and waits 5 minutes between sending each probe. If you don’t specify any timing, Nmap uses normal -T3. Note that -T5 is the most aggressive in terms of speed; however, this can affect the accuracy of the scan results due to the increased likelihood of packet loss. Note that -T4 is often used during CTFs and when learning to scan on practice targets, whereas -T1 is often used during real engagements where stealth is more important. Alternatively, you can choose to control the packet rate using --min-rate &lt;number&gt; and --max-rate &lt;number&gt;. For example, --max-rate 10 or --max-rate=10 ensures that your scanner is not sending more than ten packets per second. Moreover, you can control probing parallelization using --min-parallelism &lt;numprobes&gt; and --max-parallelism &lt;numprobes&gt;. Nmap probes the targets to discover which hosts are live and which ports are open; probing parallelization specifies the number of such probes that can be run in parallel. For instance, --min-parallelism=512 pushes Nmap to maintain at least 512 probes in parallel; these 512 probes are related to host discovery and open ports. TASK 8 - SUMMARYThis room covered three types of scans: TCP Connect TCP SYN UDP These scan types should get you started discovering running TCP and UDP services on a target host. DONE THANK YOU,Satvik Shetty","link":"/2024/05/16/Basic-Port-Scan-THM/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2024/05/16/hello-world/"}],"tags":[{"name":"resources","slug":"resources","link":"/tags/resources/"},{"name":"cybersecurity","slug":"cybersecurity","link":"/tags/cybersecurity/"},{"name":"hacking","slug":"hacking","link":"/tags/hacking/"},{"name":"tryhackme","slug":"tryhackme","link":"/tags/tryhackme/"},{"name":"nmap","slug":"nmap","link":"/tags/nmap/"},{"name":"information-gathering","slug":"information-gathering","link":"/tags/information-gathering/"}],"categories":[],"pages":[]}