{"title":"BurpSuite: The Basics- THM","uid":"47b6d8287ac634ea0ec9f7574ea320b4","slug":"THM/WEB/BurpSuite-The-Basics-THM","date":"2024-06-12T14:14:18.000Z","updated":"2024-06-13T15:39:23.599Z","comments":true,"path":"api/articles/THM/WEB/BurpSuite-The-Basics-THM.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/b6ca1936746a8f3057f0d082d7886689.svg","content":"<p><strong>Hello Hackers</strong> 💌<br><strong>Today we are gonna walkthrough a new room in <code>Web Fundamentals</code> called <code>Content Discovery</code> on #TryHackMe</strong><br><strong>Lets start</strong> 🚀</p>\n<a href=\"https://notes.satvik.live/web-fundamentals-path/content-discovery/\" style=\"text-decoration:none;\">\n  <button style=\"\n    background: linear-gradient(90deg, rgba(0,123,255,1) 0%, rgba(0,102,204,1) 100%);\n    border: none; /* Remove borders */\n    color: white; /* White text */\n    padding: 10px 20px; /* Some padding */\n    text-align: center; /* Centered text */\n    text-decoration: none; /* Remove underline */\n    display: flex; /* Use flexbox */\n    align-items: center; /* Center items vertically */\n    justify-content: center; /* Center items horizontally */\n    font-size: 16px; /* Increase font size */\n    margin: 4px 2px; /* Add some margin */\n    cursor: pointer; /* Add a pointer on hover */\n    border-radius: 12px; /* Rounded corners */\n    box-shadow: 0 4px 6px rgba(0, 0, 0, 0.1); /* Add shadow */\n    transition: transform 0.2s; /* Animation for hover effect */\n    height: 40px; /* Fixed height for better alignment */\n  \" onmouseover=\"this.style.transform='scale(1.05)';\" onmouseout=\"this.style.transform='scale(1.0)';\">\n    View notes 👀\n  </button>\n</a>\n\n<h1 id=\"TASK-1-Introduction\"><a href=\"#TASK-1-Introduction\" class=\"headerlink\" title=\"TASK 1 - Introduction\"></a>TASK 1 - Introduction</h1><p>Welcome to Burp Suite Basics!<br>This particular room aims to understand the basics of the Burp Suite web application security testing framework. Our focus will revolve around the following key aspects:</p>\n<ul>\n<li>A thorough introduction to Burp Suite.</li>\n<li>A comprehensive overview of the various tools available within the framework.</li>\n<li>Detailed guidance on the process of installing Burp Suite on your system.</li>\n<li>Navigating and configuring Burp Suite.</li>\n</ul>\n<p>We will also introduce the core of the Burp Suite framework, which is the Burp Proxy. It is important to note that this room primarily serves as a foundational resource for acquiring knowledge about Burp Suite. Subsequent rooms in the Burp module will adopt a more practical approach. Thus, this room will contain a greater emphasis on theoretical content. If you have not yet utilised Burp Suite, it is recommended to carefully read the provided information and actively engage with the tool. Experimentation is essential for grasping the fundamentals of this framework. Combining the information presented here with hands-on exploration will establish a strong foundation for utilising the framework. This will significantly assist you in future rooms.</p>\n<h1 id=\"TASK-2-What-is-burp-suite\"><a href=\"#TASK-2-What-is-burp-suite\" class=\"headerlink\" title=\"TASK 2 - What is burp suite ?\"></a>TASK 2 - What is burp suite ?</h1><p>In essence, Burp Suite is a Java-based framework designed to serve as a comprehensive solution for conducting web application penetration testing. It has become the industry standard tool for hands-on security assessments of web and mobile applications, including those that rely on application programming interfaces (APIs).</p>\n<p>Simply put, Burp Suite captures and enables manipulation of all the HTTP&#x2F;HTTPS traffic between a browser and a web server. This fundamental capability forms the backbone of the framework. By intercepting requests, users have the flexibility to route them to various components within the Burp Suite framework, which we will explore in upcoming sections. The ability to intercept, view, and modify web requests before they reach the target server or even manipulate responses before they are received by our browser makes Burp Suite an invaluable tool for manual web application testing.</p>\n<p>Burp Suite is available in different editions. For our purposes, we will focus on the Burp Suite Community Edition, which is freely accessible for non-commercial use within legal boundaries. However, it’s worth noting that Burp Suite also offers Professional and Enterprise editions, which come with advanced features and require licensing:</p>\n<ol>\n<li>Burp Suite Professional is an unrestricted version of Burp Suite Community. It comes with features such as:</li>\n</ol>\n<p>  An automated vulnerability scanner.<br>  A fuzzer&#x2F;brute-forcer that isn’t rate limited.<br>  Saving projects for future use and report generation.<br>  A built-in API to allow integration with other tools.<br>  Unrestricted access to add new extensions for greater functionality.<br>  Access to the Burp Suite Collaborator (effectively providing a unique request catcher self-hosted or running on a Portswigger-owned server).</p>\n<p>In short, Burp Suite Professional is a highly potent tool, making it a preferred choice for professionals in the field.</p>\n<ol start=\"2\">\n<li>Burp Suite Enterprise, in contrast to the community and professional editions, is primarily utilized for continuous scanning. It features an automated scanner that periodically scans web applications for vulnerabilities, similar to how tools like Nessus perform automated infrastructure scanning. Unlike the other editions, which allow manual attacks from a local machine, Burp Suite Enterprise resides on a server and constantly scans the target web applications for potential vulnerabilities.</li>\n</ol>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/645b19f5d5848d004ab9c9e2/room-content/6b7cdf06b365b6908c41525e8efb86e0.png\" alt=\"i\"></p>\n<p>Due to requiring a license for the Professional and Enterprise editions, we will focus on the core feature set provided by the Burp Suite Community Edition.</p>\n<p><strong>Note:</strong> The provided demonstrations utilize Burp Suite for Windows. However, the functionality remains consistent with the version installed on the AttackBox.</p>\n<h2 id=\"Answer-the-questions-below\"><a href=\"#Answer-the-questions-below\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. Which edition of Burp Suite runs on a server and provides constant scanning for target web apps?</strong><br>Answer: <code>Burp Suite Enterprise</code></p>\n<p><strong>2. Burp Suite is frequently used when attacking web applications and ______ applications.</strong><br>Answers: <code>Mobile</code></p>\n<h1 id=\"TASK-3-Features-of-Burp-Community\"><a href=\"#TASK-3-Features-of-Burp-Community\" class=\"headerlink\" title=\"TASK 3 - Features of Burp Community\"></a>TASK 3 - Features of Burp Community</h1><p>Although Burp Suite Community offers a more limited feature set compared to the Professional edition, it still provides an impressive array of tools that are highly valuable for web application testing. Let’s explore some of the key features:</p>\n<p><strong>Proxy:</strong> The Burp Proxy is the most renowned aspect of Burp Suite. It enables interception and modification of requests and responses while interacting with web applications.<br><strong>Repeater:</strong> Another well-known feature. Repeater allows for capturing, modifying, and resending the same request multiple times. This functionality is particularly useful when crafting payloads through trial and error (e.g., in SQLi - Structured Query Language Injection) or testing the functionality of an endpoint for vulnerabilities.<br><strong>Intruder:</strong> Despite rate limitations in Burp Suite Community, Intruder allows for spraying endpoints with requests. It is commonly utilized for brute-force attacks or fuzzing endpoints.<br><strong>Decoder:</strong> Decoder offers a valuable service for data transformation. It can decode captured information or encode payloads before sending them to the target. While alternative services exist for this purpose, leveraging Decoder within Burp Suite can be highly efficient.<br><strong>Comparer:</strong> As the name suggests, Comparer enables the comparison of two pieces of data at either the word or byte level. While not exclusive to Burp Suite, the ability to send potentially large data segments directly to a comparison tool with a single keyboard shortcut significantly accelerates the process.<br><strong>Sequencer:</strong> Sequencer is typically employed when assessing the randomness of tokens, such as session cookie values or other supposedly randomly generated data. If the algorithm used for generating these values lacks secure randomness, it can expose avenues for devastating attacks.<br>Beyond the built-in features, the Java codebase of Burp Suite facilitates the development of extensions to enhance the framework’s functionality. These extensions can be written in Java, Python (using the Java Jython interpreter), or Ruby (using the Java JRuby interpreter). The Burp Suite Extender module allows for quick and easy loading of extensions into the framework, while the marketplace, known as the BApp Store, enables downloading of third-party modules. While certain extensions may require a professional license for integration, there are still a considerable number of extensions available for Burp Community. For instance, the Logger++ module can extend the built-in logging functionality of Burp Suite.</p>\n<h2 id=\"Answer-the-questions-below-1\"><a href=\"#Answer-the-questions-below-1\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. Which Burp Suite feature allows us to intercept requests between ourselves and the target?</strong><br>Answer: <code>Proxy</code></p>\n<p><strong>2. Which Burp tool would we use to brute-force a login form?</strong><br>Answer: <code>Intruder</code></p>\n<h1 id=\"TASK-4-Installation\"><a href=\"#TASK-4-Installation\" class=\"headerlink\" title=\"TASK 4 - Installation\"></a>TASK 4 - Installation</h1><p>Burp Suite is one of those tools that is very useful to have around, whether for web or mobile application assessments, pentesting, bug bounty hunting, or even debugging features in web app development. Here’s a guide on installing Burp Suite on different platforms:</p>\n<p><strong>Note:</strong> If you use the AttackBox, Burp Suite is already installed, so you can skip this step.</p>\n<p><strong>Downloads</strong><br>To download the latest version of Burp Suite for other systems, you may click this button to go to their download page.</p>\n<p><em>Kali Linux:</em> Burp Suite comes pre-installed with Kali Linux. In case it is missing on your Kali installation, you can easily install it from the Kali apt repositories.</p>\n<p><em>Linux, macOS, and Windows:</em> For other operating systems, PortSwigger provides dedicated installers for Burp Suite Community and Burp Suite Professional on the Burp Suite downloads page. Choose your operating system from the dropdown menu and select Burp Suite Community Edition. Then, click the Download button to initiate the download.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/645b19f5d5848d004ab9c9e2/room-content/cf27fb99c50eb3c2784212d4f56a7b82.png\" alt=\"P\"></p>\n<p><strong>Installation</strong></p>\n<p>Install Burp Suite using the appropriate method for your operating system. On Windows, run the executable file, while on Linux, execute the script from the terminal (with or without sudo). If you choose not to use <code>sudo</code> during installation on Linux, Burp Suite will be installed in your home directory at <code>~/BurpSuiteCommunity/BurpSuiteCommunity</code> and will not be added to your <code>PATH</code>.</p>\n<p>The installation wizard provides clear instructions, and it is generally safe to accept the default settings. However, it is always recommended to review the installer carefully.</p>\n<p>With Burp Suite successfully installed, you can now launch the application. In the next task, we will explore the initial setup and configuration.</p>\n<h1 id=\"TASK-5-The-Dashboard\"><a href=\"#TASK-5-The-Dashboard\" class=\"headerlink\" title=\"TASK 5 - The Dashboard\"></a>TASK 5 - The Dashboard</h1><p>You may use the pre-installed Burp Suite Community Edition in our AttackBox. To launch the AttackBox, click the <code>Start AttackBox</code> button at the top of this page.</p>\n<p>Once you launch Burp Suite and accept the terms and conditions, you will be prompted to select a project type. In Burp Suite Community, the options are limited, and you can simply click <code>Next</code> to proceed.</p>\n<p>The next window allows you to choose the configuration for Burp Suite. It is generally recommended to keep the default settings, which are suitable for most situations. Click <code>Start Burp</code> to open the main Burp Suite interface.</p>\n<p>Upon opening Burp Suite for the first time, you might encounter a screen with training options. It is highly recommended to go through these training materials when you have the time.</p>\n<p>If you don’t see the training screen (or in subsequent sessions), you will be presented with the Burp Dashboard, which may seem overwhelming at first. However, it will soon become familiar.</p>\n<p>The Burp Dashboard is divided into four quadrants, as labelled in counter-clockwise order starting from the top left:</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/11202e4c73faa30a757f1439b63b85c6.png\" alt=\"o\"></p>\n<p><strong>Tasks:</strong> The Tasks menu allows you to define background tasks that Burp Suite will perform while you use the application. In Burp Suite Community, the default “Live Passive Crawl” task, which automatically logs the pages visited, is sufficient for our purposes in this module. Burp Suite Professional offers additional features like on-demand scans.</p>\n<p><strong>Event log:</strong> The Event log provides information about the actions performed by Burp Suite, such as starting the proxy, as well as details about connections made through Burp.</p>\n<p><strong>Issue Activity:</strong> This section is specific to Burp Suite Professional. It displays the vulnerabilities identified by the automated scanner, ranked by severity and filterable based on the certainty of the vulnerability.</p>\n<p><strong>Advisory:</strong> The Advisory section provides more detailed information about the identified vulnerabilities, including references and suggested remediations. This information can be exported into a report. In Burp Suite Community, this section may not show any vulnerabilities.</p>\n<p>Throughout the various tabs and windows of Burp Suite, you will notice question mark icons (question mark icon).</p>\n<p>Clicking on these icons opens a new window with helpful information specific to that section. These help icons are invaluable when you need assistance or clarification on a particular feature, so make sure to utilise them effectively.<br><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/645b19f5d5848d004ab9c9e2/room-content/a68c56aa12934f1fa68758f086a0df3a.png\" alt=\"o\"></p>\n<p>By exploring the different tabs and functionalities of Burp Suite, you will gradually become familiar with its capabilities.</p>\n<h2 id=\"Answer-the-questions-below-2\"><a href=\"#Answer-the-questions-below-2\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. What menu provides information about the actions performed by Burp Suite, such as starting the proxy, and details about connections made through Burp?</strong><br>Answer: <code>Event log</code></p>\n<h1 id=\"TASk-6-Navigation\"><a href=\"#TASk-6-Navigation\" class=\"headerlink\" title=\"TASk 6 - Navigation\"></a>TASk 6 - Navigation</h1><p>In Burp Suite, the default navigation is primarily done through the top menu bars, which allow you to switch between modules and access various sub-tabs within each module. The sub-tabs appear in a second menu bar directly below the main menu bar.</p>\n<p><strong>Here’s how the navigation works:</strong></p>\n<p><em>Module Selection:</em> The top row of the menu bar displays the available modules in Burp Suite. You can click on each module to switch between them. For example, the Burp Proxy module is selected in the image below.</p>\n<p><em>Sub-Tabs:</em> If a selected module has multiple sub-tabs, they can be accessed through the second menu bar that appears directly below the main menu bar. These sub-tabs often contain module-specific settings and options. For example, in the image above, the Proxy Intercept sub-tab is selected within the Burp Proxy module.</p>\n<p><em>Detaching Tabs:</em> If you prefer to view multiple tabs separately, you can detach them into separate windows. To do this, go to the Window option in the application menu above the Module Selection bar. From there, choose the “Detach” option, and the selected tab will open in a separate window. The detached tabs can be reattached using the same method.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/87c7b704d11abbed8e059a0d33672613.png\" alt=\"o\"></p>\n<p>Burp Suite also provides keyboard shortcuts for quick navigation to key tabs. By default, the following shortcuts are available:</p>\n<table>\n<thead>\n<tr>\n<th>Shortcut</th>\n<th>Tab</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>Ctrl + Shift + D</td>\n<td>Dashboard</td>\n</tr>\n<tr>\n<td>Ctrl + Shift + T</td>\n<td>Target tab</td>\n</tr>\n<tr>\n<td>Ctrl + Shift + P</td>\n<td>Proxy tab</td>\n</tr>\n<tr>\n<td>Ctrl + Shift + I</td>\n<td>Intruder tab</td>\n</tr>\n<tr>\n<td>Ctrl + Shift + R</td>\n<td>Repeater tab</td>\n</tr>\n</tbody></table>\n<h2 id=\"Answer-the-questions-below-3\"><a href=\"#Answer-the-questions-below-3\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. Which tab Ctrl + Shift + P will switch us to?</strong><br>Answer: Proxy Tab</p>\n<h1 id=\"TASk-7-Options\"><a href=\"#TASk-7-Options\" class=\"headerlink\" title=\"TASk 7 - Options\"></a>TASk 7 - Options</h1><p>Before diving into the Burp Proxy, let’s explore the available options for configuring Burp Suite. There are two types of settings: Global settings (also known as User settings) and Project settings.</p>\n<p><strong>Global Settings:</strong> These settings affect the entire Burp Suite installation and are applied every time you start the application. They provide a baseline configuration for your Burp Suite environment.</p>\n<p><strong>Project Settings:</strong> These settings are specific to the current project and apply only during the session. However, please note that Burp Suite Community Edition does not support saving projects, so any project-specific options will be lost when you close Burp.</p>\n<p>To access the <em>settings</em>, click on the Settings button in the top navigation bar. This will open a separate settings window.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/40a3ea01d6eadc91d98499c3f921c90f.png\" alt=\"Settings button to open the separate settings window\"></p>\n<p>Below is the image showing the separate settings window.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/8a6df0ac968a5c33e91903b350253b6b.png\" alt=\"s\"></p>\n<p>In the Settings window, you will find a menu on the left-hand side. This menu allows you to switch between different types of settings, including:</p>\n<p><strong>1.</strong> Search: Enables searching for specific settings using keywords.<br><strong>2.</strong> Type filter: Filters the settings for User and Project options.</p>\n<ul>\n<li><em>User settings:</em> Shows settings that affect the entire Burp Suite installation.</li>\n<li><em>Project settings:</em> Displays settings specific to the current project.</li>\n</ul>\n<p><strong>3.</strong> Categories: Allows selecting settings by category.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/645b19f5d5848d004ab9c9e2/room-content/04cf1a4164616772d9495a3ee2bfd10a.png\" alt=\"Project settings button\"></p>\n<p>It’s worth noting that many tools within Burp Suite provide shortcuts to specific categories of settings. For example, the <code>Proxy</code> module includes a <code>Proxy settings</code> button that opens the settings window directly to the relevant proxy section.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/09211709d4034aa42ce403780ca12ba0.png\" alt=\"0h\"></p>\n<p>The search feature on the settings page is a valuable addition, allowing you to quickly search for settings using keywords.</p>\n<p>Take some time to familiarise yourself with the range of configurable options in Burp Suite. Once you are comfortable, you can proceed with the exercises related to configuring Burp Suite settings.</p>\n<h2 id=\"Answer-the-questions-below-4\"><a href=\"#Answer-the-questions-below-4\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. In which category can you find a reference to a “Cookie jar”?</strong><br>Answer: <code>Sessions</code></p>\n<p><strong>2. In which base category can you find the “Updates” sub-category, which controls the Burp Suite update behaviour?</strong><br>Answer: <code>Suite</code></p>\n<p><strong>3. What is the name of the sub-category which allows you to change the keybindings for shortcuts in Burp Suite?</strong><br>Answer: <code>Hotkeys</code></p>\n<p><strong>4. If we have uploaded Client-Side TLS certificates, can we override these on a per-project basis (yea&#x2F;nay)?</strong><br>Answer: <code>yea</code></p>\n<h1 id=\"TASK-8-Introduction-to-the-Burp-Proxy\"><a href=\"#TASK-8-Introduction-to-the-Burp-Proxy\" class=\"headerlink\" title=\"TASK 8 - Introduction to the Burp Proxy\"></a>TASK 8 - Introduction to the Burp Proxy</h1><p>The Burp Proxy is a fundamental and crucial tool within Burp Suite. It enables the capture of requests and responses between the user and the target web server. This intercepted traffic can be manipulated, sent to other tools for further processing, or explicitly allowed to continue to its destination.</p>\n<p><strong>Key Points to Understand About the Burp Proxy</strong></p>\n<ul>\n<li><em>Intercepting Requests:</em> When requests are made through the Burp Proxy, they are intercepted and held back from reaching the target server. The requests appear in the Proxy tab, allowing for further actions such as forwarding, dropping, editing, or sending them to other Burp modules. To disable the intercept and allow requests to pass through the proxy without interruption, click the <code>Intercept is on</code> button.</li>\n</ul>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/73989984d0985412a3405ea1d6f8d171.png\"></p>\n<ul>\n<li><p><em>Taking Control:</em> The ability to intercept requests empowers testers to gain complete control over web traffic, making it invaluable for testing web applications.</p>\n</li>\n<li><p><em>Capture and Logging:</em> Burp Suite captures and logs requests made through the proxy by default, even when the interception is turned off. This logging functionality can be helpful for later analysis and review of prior requests.</p>\n</li>\n<li><p><em>WebSocket Support:</em> Burp Suite also captures and logs WebSocket communication, providing additional assistance when analysing web applications.</p>\n</li>\n<li><p><em>Logs and History:</em> The captured requests can be viewed in the HTTP history and WebSockets history sub-tabs, allowing for retrospective analysis and sending the requests to other Burp modules as needed.</p>\n</li>\n</ul>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/8d5388b41dc847d2af38acf7ef4b116c.png\" alt=\"o\"></p>\n<p>Proxy-specific options can be accessed by clicking the Proxy settings button. These options provide extensive control over the Proxy’s behaviour and functionality. Familiarise yourself with these options to optimize your Burp Proxy usage.</p>\n<p><strong>Some Notable Features in the Proxy Settings</strong></p>\n<ul>\n<li><em>Response Interception:</em> By default, the proxy does not intercept server responses unless explicitly requested on a per-request basis. The “Intercept responses based on the following rules” checkbox, along with the defined rules, allows for a more flexible response interception.</li>\n</ul>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/e24fd91064186b78014d6afd773d60f3.png\" alt=\"i\"></p>\n<ul>\n<li><em>Match and Replace:</em> The “Match and Replace” section in the Proxy settings enables the use of regular expressions (regex) to modify incoming and outgoing requests. This feature allows for dynamic changes, such as modifying the user agent or manipulating cookies.</li>\n</ul>\n<p>Take the time to explore and experiment with the Proxy options, as this will enhance your understanding and proficiency with the tool.</p>\n<h1 id=\"TASK-9-Connecting-through-the-Proxy-FoxyProxy\"><a href=\"#TASK-9-Connecting-through-the-Proxy-FoxyProxy\" class=\"headerlink\" title=\"TASK 9 - Connecting through the Proxy (FoxyProxy)\"></a>TASK 9 - Connecting through the Proxy (FoxyProxy)</h1><p>Start the machine by clicking the Start Machine button at the upper right corner of this task.</p>\n<p>To use the Burp Suite Proxy, we need to configure our local web browser to redirect traffic through Burp Suite. In this task, we will focus on configuring the proxy using the FoxyProxy extension in Firefox.</p>\n<p>Please note that the instructions provided are specific to Firefox. If you are using a different browser, you may need to find alternative methods or use the TryHackMe AttackBox.</p>\n<p><strong>Here are the steps to configure the Burp Suite Proxy with FoxyProxy:</strong></p>\n<p><em>Install FoxyProxy:</em> Download and install the FoxyProxy Basic extension.</p>\n<p><em>Note</em>: FoxyProxy is already installed on the AttackBox.</p>\n<p><em>Access FoxyProxy Options:</em> Once installed, a button will appear at the top right of the Firefox browser. Click on the FoxyProxy button to access the FoxyProxy options pop-up.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/fee3f150ebb4d9301023188fddc0458a.png\" alt=\"o\"></p>\n<p><em>Create Burp Proxy Configuration:</em> In the FoxyProxy options pop-up, click the Options button. This will open a new browser tab with the FoxyProxy configurations. Click the Add button to create a new proxy configuration.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/5a73425b5de3395c5db2962b9d613506.png\" alt=\"o\"></p>\n<p><em>Add Proxy Details:</em> On the “Add Proxy” page, fill in the following values:</p>\n<p>Title: Burp (or any preferred name)<br>Proxy IP: 127.0.0.1<br>Port: 8080</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/5a73425b5de3395c5db2962b9d613506.png\" alt=\"p\"></p>\n<p><em>Save Configuration:</em> Click Save to save the Burp Proxy configuration.</p>\n<p><em>Activate Proxy Configuration:</em> Click on the FoxyProxy icon at the top-right of the Firefox browser and select the Burp configuration. This will redirect your browser traffic through 127.0.0.1:8080. Note that Burp Suite must be running for your browser to make requests when this configuration is activated.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5d9e176315f8850e719252ed/room-content/20f5e9db304d164b57c7f7d89fabc63a.png\" alt=\"p\"></p>\n<p>Enable Proxy Intercept in Burp Suite: Switch to Burp Suite and ensure that Intercept is turned on in the Proxy tab.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/645b19f5d5848d004ab9c9e2/room-content/9e0f6f47486737deff0e16c4e066120f.png\" alt=\"p\"></p>\n<p>Test the Proxy: Open Firefox and try accessing a website, such as the homepage for <a href=\"http://machine_ip/\">http://MACHINE_IP/</a>. Your browser will hang, and the proxy will populate with the HTTP request. Congratulations, you have successfully intercepted your first request!</p>\n<p><strong>Remember the following:</strong></p>\n<p>When the proxy configuration is active, and the intercept is switched on in Burp Suite, your browser will hang whenever you make a request.<br>Be cautious not to leave the intercept switched on unintentionally, as it can prevent your browser from making any requests.<br>Right-clicking on a request in Burp Suite allows you to perform various actions, such as forwarding, dropping, sending to other tools, or selecting options from the right-click menu.<br>Take note of these details as you begin using the Burp Suite Proxy.</p>\n<p><em>Note:</em> Consider closing the other tabs in the AttackBox browser before enabling interception, as you will receive some WebSocket requests instead of request from the target VM.</p>\n<h1 id=\"TASk-10-Site-Map-and-Issue-Definitions\"><a href=\"#TASk-10-Site-Map-and-Issue-Definitions\" class=\"headerlink\" title=\"TASk 10 - Site Map and Issue Definitions\"></a>TASk 10 - Site Map and Issue Definitions</h1><p><strong>The Target tab in Burp Suite provides more than just control over the scope of our testing. It consists of three sub-tabs:</strong></p>\n<p><em>Site map:</em> This sub-tab allows us to map out the web applications we are targeting in a tree structure. Every page that we visit while the proxy is active will be displayed on the site map. This feature enables us to automatically generate a site map by simply browsing the web application. In Burp Suite Professional, we can also use the site map to perform automated crawling of the target, exploring links between pages and mapping out as much of the site as possible. Even with Burp Suite Community, we can still utilize the site map to accumulate data during our initial enumeration steps. It is particularly useful for mapping out APIs, as any API endpoints accessed by the web application will be captured in the site map.</p>\n<p><em>Issue definitions:</em> Although Burp Community does not include the full vulnerability scanning functionality available in Burp Suite Professional, we still have access to a list of all the vulnerabilities that the scanner looks for. The Issue definitions section provides an extensive list of web vulnerabilities, complete with descriptions and references. This resource can be valuable for referencing vulnerabilities in reports or assisting in describing a particular vulnerability that may have been identified during manual testing.</p>\n<p><em>Scope settings:</em> This setting allows us to control the target scope in Burp Suite. It enables us to include or exclude specific domains&#x2F;IPs to define the scope of our testing. By managing the scope, we can focus on the web applications we are specifically targeting and avoid capturing unnecessary traffic.</p>\n<p>Overall, the Target tab offers features beyond scoping, allowing us to map out web applications, fine-tune our target scope, and access a comprehensive list of web vulnerabilities for reference purposes.</p>\n<p><strong>Challenge</strong></p>\n<p>Take a look around the site on <a href=\"http://machine_ip/\">http://MACHINE_IP/</a> — we will be using this a lot throughout the module. Visit every other page that is linked on the homepage, then check your sitemap — one endpoint should stand out as being very unusual!</p>\n<p>Visit this in your browser (or use the “Response” section of the site map entry for that endpoint)</p>\n<h2 id=\"Answer-the-questions-below-5\"><a href=\"#Answer-the-questions-below-5\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. What is the flag you receive after visiting the unusual endpoint?</strong><br>Answer:</p>\n<ul>\n<li>Turn on proxy extension in your browser</li>\n<li>now go to burpsuite and turn on Interception</li>\n<li>Comeback to the browser and visit each and every page in the site simulatneosuly forwarding the requests in the burpsuite</li>\n<li>now go to Taregt Tab and go to observer the sitemap structure of the site</li>\n<li>You will observe on new page with random name</li>\n<li>visit that page and see the content</li>\n</ul>\n<p><img src=\"https://dl.dropbox.com/scl/fi/odishy0a32tosnuwy0k6y/burp1.png?rlkey=6naw2ifuz2sq8ldp8y46o227o&st=9hvlislx&dl=0\" alt=\"i\"></p>\n<p>THM{NmNlZTliNGE1MWU1ZTQzMzgzNmFiNWVk}<br>Correct Answer<br>Hint</p>\n<p><strong>Content will update soon guys</strong><br><strong>Stay Tuned</strong><br><strong>Thank You</strong><br>❤️🥳</p>\n","feature":true,"text":"Hello Hackers 💌Today we are gonna walkthrough a new room in Web Fundamentals cal...","permalink":"/post/THM/WEB/BurpSuite-The-Basics-THM","photos":[],"count_time":{"symbolsCount":"24k","symbolsTime":"22 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":19,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":18,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":12,"path":"api/categories/cybersecurity/THM/web.json"},{"name":"Burp Suite","slug":"cybersecurity/THM/web/Burp-Suite","count":1,"path":"api/categories/cybersecurity/THM/web/Burp-Suite.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":18,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":12,"path":"api/tags/web.json"},{"name":"burpsuite","slug":"burpsuite","count":1,"path":"api/tags/burpsuite.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-1-Introduction\"><span class=\"toc-text\">TASK 1 - Introduction</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-2-What-is-burp-suite\"><span class=\"toc-text\">TASK 2 - What is burp suite ?</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-3-Features-of-Burp-Community\"><span class=\"toc-text\">TASK 3 - Features of Burp Community</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-1\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-4-Installation\"><span class=\"toc-text\">TASK 4 - Installation</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-5-The-Dashboard\"><span class=\"toc-text\">TASK 5 - The Dashboard</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-2\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASk-6-Navigation\"><span class=\"toc-text\">TASk 6 - Navigation</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-3\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASk-7-Options\"><span class=\"toc-text\">TASk 7 - Options</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-4\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-8-Introduction-to-the-Burp-Proxy\"><span class=\"toc-text\">TASK 8 - Introduction to the Burp Proxy</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-9-Connecting-through-the-Proxy-FoxyProxy\"><span class=\"toc-text\">TASK 9 - Connecting through the Proxy (FoxyProxy)</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASk-10-Site-Map-and-Issue-Definitions\"><span class=\"toc-text\">TASk 10 - Site Map and Issue Definitions</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-5\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li></ol>","author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"mapped":true,"hidden":false,"prev_post":{},"next_post":{"title":"Command Injection - THM","uid":"ddce70539670cb4101c9771354514bae","slug":"THM/WEB/Command-Injection-THM","date":"2024-06-09T16:37:06.000Z","updated":"2024-06-09T17:49:19.264Z","comments":true,"path":"api/articles/THM/WEB/Command-Injection-THM.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/a72f3f1c0445bac396659c36a1e8c355.png","text":"Hello Hackers 💌Today we are gonna walkthrough a new room in Web Fundamentals cal...","permalink":"/post/THM/WEB/Command-Injection-THM","photos":[],"count_time":{"symbolsCount":"13k","symbolsTime":"12 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":19,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":18,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":12,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":18,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":12,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"feature":true}}