{"title":"Command Injection - THM","uid":"ddce70539670cb4101c9771354514bae","slug":"THM/WEB/Command-Injection-THM","date":"2024-06-09T16:37:06.000Z","updated":"2024-06-09T17:46:24.643Z","comments":true,"path":"api/articles/THM/WEB/Command-Injection-THM.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/a72f3f1c0445bac396659c36a1e8c355.png","content":"<p><strong>Hello Hackers</strong> 💌<br><strong>Today we are gonna walkthrough a new room in <code>Web Fundamentals</code> called <code>Content Discovery</code> on #TryHackMe</strong><br><strong>Lets start</strong> 🚀</p>\n<a href=\"https://notes.satvik.live/thm-notes/web-fundamentals-path/command-injection/\" style=\"text-decoration:none;\">\n  <button style=\"\n    background: linear-gradient(90deg, rgba(0,123,255,1) 0%, rgba(0,102,204,1) 100%);\n    border: none; /* Remove borders */\n    color: white; /* White text */\n    padding: 10px 20px; /* Some padding */\n    text-align: center; /* Centered text */\n    text-decoration: none; /* Remove underline */\n    display: flex; /* Use flexbox */\n    align-items: center; /* Center items vertically */\n    justify-content: center; /* Center items horizontally */\n    font-size: 16px; /* Increase font size */\n    margin: 4px 2px; /* Add some margin */\n    cursor: pointer; /* Add a pointer on hover */\n    border-radius: 12px; /* Rounded corners */\n    box-shadow: 0 4px 6px rgba(0, 0, 0, 0.1); /* Add shadow */\n    transition: transform 0.2s; /* Animation for hover effect */\n    height: 40px; /* Fixed height for better alignment */\n  \" onmouseover=\"this.style.transform='scale(1.05)';\" onmouseout=\"this.style.transform='scale(1.0)';\">\n    View notes 👀\n  </button>\n</a>\n\n\n<h1 id=\"TASK-1-Introduction\"><a href=\"#TASK-1-Introduction\" class=\"headerlink\" title=\"TASK 1 - Introduction\"></a>TASK 1 - Introduction</h1><p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/239e76f6de5e7ebaa1dffff2d28ff36c.png\" alt=\"i\"></p>\n<p>In this room, we’re going to be covering the web vulnerability that is command injection. Once we understand what this vulnerability is, we will then showcase its impact and the risk it imposes on an application.</p>\n<p>Then, you’re going to be able to put this knowledge into practice, namely:</p>\n<ul>\n<li>How to discover the command injection vulnerability</li>\n<li>How to test and exploit this vulnerability using payloads designed for different operating systems</li>\n<li>How to prevent this vulnerability in an application</li>\n<li>Lastly, you’ll get to apply theory into practice learning in a practical at the end of the room.</li>\n</ul>\n<p>To begin with, let’s first understand what command injection is. Command injection is the abuse of an application’s behaviour to execute commands on the operating system, using the same privileges that the application on a device is running with. For example, achieving command injection on a web server running as a user named <code>joe</code> will execute commands under this <code>joe</code> user - and therefore obtain any permissions that <code>joe</code> has.</p>\n<p>Command injection is also often known as <code>“Remote Code Execution” (RCE)</code> because of the ability to remotely execute code within an application. These vulnerabilities are often the most lucrative to an attacker because it means that the attacker can directly interact with the vulnerable system. For example, an attacker may read system or user files, data, and things of that nature.</p>\n<p>For example, being able to abuse an application to perform the command <code>whoami</code> to list what user account the application is running will be an example of command injection.</p>\n<p>Command injection was one of the top ten vulnerabilities reported by Contrast Security’s AppSec intelligence report in 2019. (Contrast Security AppSec., 2019). Moreover, the OWASP framework constantly proposes vulnerabilities of this nature as one of the top ten vulnerabilities of a web application (OWASP framework).</p>\n<h1 id=\"TASK-2-Discovering-Command-Injection\"><a href=\"#TASK-2-Discovering-Command-Injection\" class=\"headerlink\" title=\"TASK 2 - Discovering Command Injection\"></a>TASK 2 - Discovering Command Injection</h1><p>This vulnerability exists because applications often use functions in programming languages such as PHP, Python and NodeJS to pass data to and to make system calls on the machine’s operating system. For example, taking input from a field and searching for an entry into a file. Take this code snippet below as an example:</p>\n<p>In this code snippet, the application takes data that a user enters in an input field named <code>$title</code> to search a directory for a song title. Let’s break this down into a few simple steps.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/a54a09f7c4efa1d340ab678ece230c44.png\" alt=\"i\"></p>\n<ol>\n<li><p>The application stores MP3 files in a directory contained on the operating system.</p>\n</li>\n<li><p>The user inputs the song title they wish to search for. The application stores this input into the <code>$title</code> variable.</p>\n</li>\n<li><p>The data within this <code>$title</code> variable is passed to the command grep to search a text file named songtitle.txt for the entry of whatever the user wishes to search for.</p>\n</li>\n<li><p>The output of this search of songtitle.txt will determine whether the application informs the user that the song exists or not.</p>\n</li>\n</ol>\n<p>Now, this sort of information would typically be stored in a database; however, this is just an example of where an application takes input from a user to interact with the application’s operating system.</p>\n<p>An attacker could abuse this application by injecting their own commands for the application to execute. Rather than using grep to search for an entry in songtitle.txt, they could ask the application to read data from a more sensitive file.</p>\n<p>Abusing applications in this way can be possible no matter the programming language the application uses. As long as the application processes and executes it, it can result in command injection. For example, this code snippet below is an application written in Python.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/04a1cb87fad0a9b47761afddc48e0bf2.png\" alt=\"o\"></p>\n<p>Note, you are not expected to understand the syntax behind these applications. However, for the sake of reason, I have outlined the steps of how this Python application works as well.</p>\n<p>The “flask” package is used to set up a web server<br>A function that uses the “subprocess” package to execute a command on the device<br>We use a route in the webserver that will execute whatever is provided. For example, to execute whoami, we’d need to visit <a href=\"http://flaskapp.thm/whoami\">http://flaskapp.thm/whoami</a></p>\n<h2 id=\"Answer-the-questions-below\"><a href=\"#Answer-the-questions-below\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. What variable stores the user’s input in the PHP code snippet in this task?</strong><br>Answer: <code>$title</code></p>\n<p><strong>2. What HTTP method is used to retrieve data submitted by a user in the PHP code snippet?</strong><br>Answer: <code>GET</code></p>\n<p><strong>3. If I wanted to execute the id command in the Python code snippet, what route would I need to visit?</strong><br>Answer: <code>/id</code></p>\n<h1 id=\"TASK-3-Exploiting-Command-Injection\"><a href=\"#TASK-3-Exploiting-Command-Injection\" class=\"headerlink\" title=\"TASK 3 - Exploiting Command Injection\"></a>TASK 3 - Exploiting Command Injection</h1><p><strong>Understanding Command Injection in Web Applications</strong></p>\n<p>You can often determine whether or not command injection may occur by the behaviors of an application, as you will come to see in the practical session of this room.</p>\n<p>Applications that use user input to populate system commands with data can often be combined in unintended behaviors. For example, the shell operators <code>;</code>, <code>&amp;</code>, and <code>&amp;&amp;</code> will combine two (or more) system commands and execute them both. If you are unfamiliar with this concept, it is worth checking out the Linux fundamentals module to learn more about this.</p>\n<p>Command Injection can be detected in mostly one of two ways:</p>\n<ol>\n<li><strong>Blind command injection</strong></li>\n<li><strong>Verbose command injection</strong></li>\n</ol>\n<p>I have defined these two methods in the table below, where the two sections underneath will explain these in greater detail.</p>\n<table>\n<thead>\n<tr>\n<th>Method</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody><tr>\n<td><strong>Blind</strong></td>\n<td>This type of injection is where there is no direct output from the application when testing payloads. You will have to investigate the behaviors of the application to determine whether or not your payload was successful.</td>\n</tr>\n<tr>\n<td><strong>Verbose</strong></td>\n<td>This type of injection is where there is direct feedback from the application once you have tested a payload. For example, running the <code>whoami</code> command to see what user the application is running under. The web application will output the username on the page directly.</td>\n</tr>\n</tbody></table>\n<p><strong>Detecting Blind Command Injection</strong></p>\n<p>Blind command injection is when command injection occurs; however, there is no output visible, so it is not immediately noticeable. For example, a command is executed, but the web application outputs no message.</p>\n<p>For this type of command injection, we will need to use payloads that will cause some time delay. For example, the <code>ping</code> and <code>sleep</code> commands are significant payloads to test with. Using <code>ping</code> as an example, the application will hang for <em>x</em> seconds in relation to how many pings you have specified.</p>\n<p>Another method of detecting blind command injection is by forcing some output. This can be done by using redirection operators such as <code>&gt;</code>. If you are unfamiliar with this, I recommend checking out the Linux fundamentals module. For example, we can tell the web application to execute commands such as <code>whoami</code> and redirect that to a file. We can then use a command such as <code>cat</code> to read this newly created file’s contents.</p>\n<p>Testing command injection this way is often complicated and requires quite a bit of experimentation, significantly as the syntax for commands varies between Linux and Windows.</p>\n<p>The <code>curl</code> command is a great way to test for command injection. This is because you are able to use <code>curl</code> to deliver data to and from an application in your payload. Take this code snippet below as an example, a simple <code>curl</code> payload to an application is possible for command injection.</p>\n<figure class=\"highlight bash\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">curl http://vulnerable.app/process.php?search=The%20Beatles;%20whoami</span><br></pre></td></tr></table></figure>\n\n<p><strong>Detecting Verbose Command Injection</strong></p>\n<p>Detecting command injection this way is arguably the easiest method of the two. Verbose command injection is when the application gives you feedback or output as to what is happening or being executed.</p>\n<p>For example, the output of commands such as <code>ping</code> or <code>whoami</code> is directly displayed on the web application.</p>\n<p><strong>Useful Payloads</strong></p>\n<p>I have compiled some valuable payloads for both Linux &amp; Windows into the tables below.</p>\n<p><strong>Linux</strong></p>\n<table>\n<thead>\n<tr>\n<th>Payload</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody><tr>\n<td><code>whoami</code></td>\n<td>See what user the application is running under.</td>\n</tr>\n<tr>\n<td><code>ls</code></td>\n<td>List the contents of the current directory. You may be able to find files such as configuration files, environment files (tokens and application keys), and many more valuable things.</td>\n</tr>\n<tr>\n<td><code>ping</code></td>\n<td>This command will invoke the application to hang. This will be useful in testing an application for blind command injection.</td>\n</tr>\n<tr>\n<td><code>sleep</code></td>\n<td>This is another useful payload in testing an application for blind command injection, where the machine does not have <code>ping</code> installed.</td>\n</tr>\n<tr>\n<td><code>nc</code></td>\n<td>Netcat can be used to spawn a reverse shell onto the vulnerable application. You can use this foothold to navigate around the target machine for other services, files, or potential means of escalating privileges.</td>\n</tr>\n</tbody></table>\n<p><strong>Windows</strong></p>\n<table>\n<thead>\n<tr>\n<th>Payload</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody><tr>\n<td><code>whoami</code></td>\n<td>See what user the application is running under.</td>\n</tr>\n<tr>\n<td><code>dir</code></td>\n<td>List the contents of the current directory. You may be able to find files such as configuration files, environment files (tokens and application keys), and many more valuable things.</td>\n</tr>\n<tr>\n<td><code>ping</code></td>\n<td>This command will invoke the application to hang. This will be useful in testing an application for blind command injection.</td>\n</tr>\n<tr>\n<td><code>timeout</code></td>\n<td>This command will also invoke the application to hang. It is also useful for testing an application for blind command injection if the <code>ping</code> command is not installed.</td>\n</tr>\n</tbody></table>\n<h2 id=\"Answer-the-questions-below-1\"><a href=\"#Answer-the-questions-below-1\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. What payload would I use if I wanted to determine what user the application is running as?</strong><br>Answer: <code>whoami</code></p>\n<p><strong>2. What popular network tool would I use to test for blind command injection on a Linux machine?</strong><br>Answer: <code>ping</code></p>\n<p><strong>3. What payload would I use to test a Windows machine for blind command injection?</strong><br>Answer: <code>timeout</code></p>\n<h1 id=\"TASK-4-Remediating-Command-Injection\"><a href=\"#TASK-4-Remediating-Command-Injection\" class=\"headerlink\" title=\"TASK 4 - Remediating Command Injection\"></a>TASK 4 - Remediating Command Injection</h1><p>Command injection can be prevented in a variety of ways. Everything from minimal use of potentially dangerous functions or libraries in a programming language to filtering input without relying on a user’s input. I have detailed these a bit further below. The examples below are of the PHP programming language; however, the same principles can be extended to many other languages.</p>\n<p><strong>Vulnerable Functions</strong></p>\n<p>In <code>PHP</code>, many functions interact with the operating system to execute commands via shell; these include:</p>\n<ul>\n<li>Exec</li>\n<li>Passthru</li>\n<li>System</li>\n</ul>\n<p>Take this snippet below as an example. Here, the application will only accept and process numbers that are inputted into the form. This means that any commands such as <code>whoami</code> will not be processed.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/14acf436361fcfb7efced4b2f416b3d5.png\" alt=\"i\"></p>\n<ol>\n<li>The application will only accept a specific pattern of characters (the digits  0-9)</li>\n<li>The application will then only proceed to execute this data which is all numerical.</li>\n</ol>\n<p>These functions take input such as a string or user data and will execute whatever is provided on the system. Any application that uses these functions without proper checks will be vulnerable to command injection.</p>\n<p><strong>Input sanitisation</strong></p>\n<p>Sanitising any input from a user that an application uses is a great way to prevent command injection. This is a process of specifying the formats or types of data that a user can submit. For example, an input field that only accepts numerical data or removes any special characters such as <code>&gt; ,  &amp; and /</code>.</p>\n<p>In the snippet below, the <code>filter_input</code> PHP function is used to check whether or not any data submitted via an input form is a number or not. If it is not a number, it must be invalid input.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/06e83dfe3791664ed0bb9bc9ffd3e581.png\" alt=\"i\"></p>\n<p><strong>Bypassing Filters</strong></p>\n<p>Applications will employ numerous techniques in filtering and sanitising data that is taken from a  user’s input. These filters will restrict you to specific payloads; however, we can abuse the logic behind an application to bypass these filters. For example, an application may strip out quotation marks; we can instead use the hexadecimal value of this to achieve the same result.</p>\n<p>When executed, although the data given will be in a different format than what is expected, it can still be interpreted and will have the same result.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/fd59464e2884390ee1b8bb52b327d454.png\" alt=\"i\"></p>\n<h2 id=\"Answer-the-questions-below-2\"><a href=\"#Answer-the-questions-below-2\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. What is the term for the process of “cleaning” user input that is provided to an application?</strong><br>Answer: <code>sanitisation</code></p>\n<h1 id=\"TASK-5-Practical-Command-Injection-Deploy\"><a href=\"#TASK-5-Practical-Command-Injection-Deploy\" class=\"headerlink\" title=\"TASK 5 - Practical: Command Injection (Deploy)\"></a>TASK 5 - Practical: Command Injection (Deploy)</h1><p>Deploy the machine attached to this task; it will be visible in the split-screen view once it is ready.</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5de96d9ca744773ea7ef8c00/room-content/32b86b4183b33d87911340a9effc566a.png\" alt=\"i\"></p>\n<p>Test some payloads on the application hosted on the website visible in split-screen view to test for command injection. Refer to this cheat sheet if you are stuck or wish to explore some more complex payloads.</p>\n<p>Find the contents of the flag located in &#x2F;home&#x2F;tryhackme&#x2F;flag.txt. You can use a variety of payloads to achieve this – I recommend trying multiple.</p>\n<h2 id=\"Answer-the-questions-below-3\"><a href=\"#Answer-the-questions-below-3\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><p><strong>1. What user is this application running as?</strong><br>Enter the command : <code>&amp; whoami</code></p>\n<p>Answer: <code>www-data</code></p>\n<p><strong>2. What are the contents of the flag located in &#x2F;home&#x2F;tryhackme&#x2F;flag.txt?</strong><br>Enter the command : <code> &amp; cat /home/tryhackme/flag.txt</code></p>\n<p>ANswer: <code>THM&#123;COMMAND_INJECTION_COMPLETE&#125;</code></p>\n<p><strong>Thank You</strong> 💌<br><strong>Author:</strong> <code>Satvik Shetty</code>🧑‍💻<br><strong>See you again in another writeup</strong></p>\n","feature":true,"text":"Hello Hackers 💌Today we are gonna walkthrough a new room in Web Fundamentals cal...","permalink":"/post/THM/WEB/Command-Injection-THM","photos":[],"count_time":{"symbolsCount":"13k","symbolsTime":"12 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":18,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":17,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":11,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":17,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":11,"path":"api/tags/web.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-1-Introduction\"><span class=\"toc-text\">TASK 1 - Introduction</span></a></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-2-Discovering-Command-Injection\"><span class=\"toc-text\">TASK 2 - Discovering Command Injection</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-3-Exploiting-Command-Injection\"><span class=\"toc-text\">TASK 3 - Exploiting Command Injection</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-1\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-4-Remediating-Command-Injection\"><span class=\"toc-text\">TASK 4 - Remediating Command Injection</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-2\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-5-Practical-Command-Injection-Deploy\"><span class=\"toc-text\">TASK 5 - Practical: Command Injection (Deploy)</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below-3\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li></ol>","author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"mapped":true,"hidden":false,"prev_post":{},"next_post":{"title":"Intro to Cross Site Scripting","uid":"a4a70e8c6575b56163e1d8803d527b20","slug":"THM/WEB/Intro-to-Cross-Site-Scripting","date":"2024-06-08T16:41:38.000Z","updated":"2024-06-09T17:46:36.216Z","comments":true,"path":"api/articles/THM/WEB/Intro-to-Cross-Site-Scripting.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/c1c509a263e7a42bece2f0b77fd1ba1b.png","text":"Hello Hackers 💌Today we are gonna walkthrough a new room in Web Fundamentals cal...","permalink":"/post/THM/WEB/Intro-to-Cross-Site-Scripting","photos":[],"count_time":{"symbolsCount":"22k","symbolsTime":"20 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":18,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":17,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":11,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":17,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":11,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","link":"https://media.licdn.com/dms/image/D5603AQHDAkzc5VpLcQ/profile-displayphoto-shrink_800_800/0/1708273426443?e=1721260800&v=beta&t=6mDy44GnhG2deGxjMd9TUFy-WKUpt7jNSNcdJD47uYc","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"feature":true}}