{"title":"HTTP in detail - THM","uid":"5904c8f0bb1680bf04de5ca4eafa3e53","slug":"THM/WEB/HTTP-in-detail-THM","date":"2024-05-22T18:09:01.000Z","updated":"2024-05-22T18:52:02.661Z","comments":true,"path":"api/articles/THM/WEB/HTTP-in-detail-THM.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/b0efa907bff6e3c77b2aa24ea6b8bb59.png","content":"<h1 id=\"HTTP-in-Detail\"><a href=\"#HTTP-in-Detail\" class=\"headerlink\" title=\"HTTP in Detail\"></a>HTTP in Detail</h1><h2 id=\"What-is-HTTP-HyperText-Transfer-Protocol\"><a href=\"#What-is-HTTP-HyperText-Transfer-Protocol\" class=\"headerlink\" title=\"What is HTTP? (HyperText Transfer Protocol)\"></a>What is HTTP? (HyperText Transfer Protocol)</h2><p>HTTP is what’s used whenever you view a website, developed by Tim Berners-Lee and his team between 1989-1991. HTTP is the set of rules used for communicating with web servers for the transmitting of webpage data, whether that is HTML, Images, Videos, etc.</p>\n<p><strong>What is HTTPS? (HyperText Transfer Protocol Secure)</strong></p>\n<p>HTTPS is the secure version of HTTP. HTTPS data is encrypted so it not only stops people from seeing the data you are receiving and sending, but it also gives you assurances that you’re talking to the correct web server and not something impersonating it.</p>\n<h3 id=\"Questions-and-Answers-in-the-task\"><a href=\"#Questions-and-Answers-in-the-task\" class=\"headerlink\" title=\"Questions and Answers in the task\"></a>Questions and Answers in the task</h3><p><strong>1. What does HTTP stands for ?</strong><br>Answer:</p>\n<ul>\n<li><code>HyperText Transfer Protocol</code><br><strong>2. What does S in HTTPS stands for ?</strong><br>Answer:</li>\n<li><code>Secure</code><br><strong>3. On the mock webpage on the right there is an issue, once you’ve found it, click on it. What is the challenge flag?</strong><br>Answer:</li>\n<li>Click on Lock Symbol<br><img src=\"https://dl.dropbox.com/scl/fi/7j77st06js5p8m5201snc/http1.png?rlkey=ueia64aea7pvrq8elpxs988j7&st=hgvxubdq&dl=0\" alt=\"i\"><br>Falg : <code>THM&#123;INVALID_HTTP_CERT&#125;</code></li>\n</ul>\n<h1 id=\"Requests-and-Responses\"><a href=\"#Requests-and-Responses\" class=\"headerlink\" title=\"Requests and Responses\"></a>Requests and Responses</h1><p>When we access a website, your browser will need to make requests to a web server for assets such as HTML, Images, and download the responses. Before that, you need to tell the browser specifically how and where to access these resources, this is where URLs will help.</p>\n<h2 id=\"What-is-a-URL-Uniform-Resource-Locator\"><a href=\"#What-is-a-URL-Uniform-Resource-Locator\" class=\"headerlink\" title=\"What is a URL? (Uniform Resource Locator)\"></a>What is a URL? (Uniform Resource Locator)</h2><p>If you’ve used the internet, you’ve used a URL before. A URL is predominantly an instruction on how to access a resource on the internet. The below image shows what a URL looks like with all of its features (it does not use all features in every request).</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5c549500924ec576f953d9fc/room-content/34ad66d8b90aaaa35f9536d3b152ea97.png\" alt=\"img\"></p>\n<p>A diagram showing different parts of a URL on an example, where http is the scheme, user:password is the user, tryhackme.com is a domain or the host, 80 is the port, view-room is the path, ?id&#x3D;1 is the query string, and #task3 is the fragment. The full address is <a href=\"http://user:password@tryhackme.com/view-room?id=1#task3\">http://user:password@tryhackme.com:80/view-room?id=1#task3</a>.</p>\n<p><strong>Scheme:</strong> This instructs on what protocol to use for accessing the resource such as HTTP, HTTPS, FTP (File Transfer Protocol).</p>\n<p><strong>User:</strong> Some services require authentication to log in, you can put a username and password into the URL to log in.</p>\n<p><strong>Host:</strong> The domain name or IP address of the server you wish to access.</p>\n<p><strong>Port:</strong> The Port that you are going to connect to, usually 80 for HTTP and 443 for HTTPS, but this can be hosted on any port between 1 - 65535.</p>\n<p><strong>Path:</strong> The file name or location of the resource you are trying to access.</p>\n<p><strong>Query String:</strong> Extra bits of information that can be sent to the requested path. For example, &#x2F;blog?id&#x3D;1 would tell the blog path that you wish to receive the blog article with the id of 1.</p>\n<p><strong>Fragment:</strong> This is a reference to a location on the actual page requested. This is commonly used for pages with long content and can have a certain part of the page directly linked to it, so it is viewable to the user as soon as they access the page.</p>\n<p><strong>Making a Request</strong></p>\n<p>It’s possible to make a request to a web server with just one line “GET &#x2F; HTTP&#x2F;1.1”</p>\n<p><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5c549500924ec576f953d9fc/room-content/09e70200e7af451077081a3ee3d3708c.png\" alt=\"e\"></p>\n<p>But for a much richer web experience, you’ll need to send other data as well. This other data is sent in what is called headers, where headers contain extra information to give to the web server you’re communicating with, but we’ll go more into this in the Header task.</p>\n<p>Example Request:</p>\n<figure class=\"highlight bash\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">GET / HTTP/1.1</span><br><span class=\"line\">Host: tryhackme.com</span><br><span class=\"line\">User-Agent: Mozilla/5.0 Firefox/87.0</span><br><span class=\"line\">Referer: https://tryhackme.com/</span><br></pre></td></tr></table></figure>\n<p><strong>To breakdown each line of this request:</strong></p>\n<p><strong>Line 1:</strong> This request is sending the GET method ( more on this in the HTTP Methods task ), request the home page with &#x2F; and telling the web server we are using HTTP protocol version 1.1.</p>\n<p><strong>Line 2:</strong> We tell the web server we want the website tryhackme.com</p>\n<p><strong>Line 3:</strong> We tell the web server we are using the Firefox version 87 Browser</p>\n<p><strong>Line 4:</strong> We are telling the web server that the web page that referred us to this one is <a href=\"https://tryhackme.com/\">https://tryhackme.com</a></p>\n<p><strong>Line 5:</strong> HTTP requests always end with a blank line to inform the web server that the request has finished.</p>\n<p>Example Response:</p>\n<figure class=\"highlight bash\"><table><tr><td class=\"gutter\"><pre><span class=\"line\">1</span><br><span class=\"line\">2</span><br><span class=\"line\">3</span><br><span class=\"line\">4</span><br><span class=\"line\">5</span><br><span class=\"line\">6</span><br><span class=\"line\">7</span><br><span class=\"line\">8</span><br><span class=\"line\">9</span><br><span class=\"line\">10</span><br><span class=\"line\">11</span><br><span class=\"line\">12</span><br><span class=\"line\">13</span><br><span class=\"line\">14</span><br></pre></td><td class=\"code\"><pre><span class=\"line\">HTTP/1.1 200 OK</span><br><span class=\"line\">Server: nginx/1.15.8</span><br><span class=\"line\">Date: Fri, 09 Apr 2021 13:34:03 GMT</span><br><span class=\"line\">Content-Type: text/html</span><br><span class=\"line\">Content-Length: 98</span><br><span class=\"line\"></span><br><span class=\"line\">&lt;html&gt;</span><br><span class=\"line\">&lt;<span class=\"built_in\">head</span>&gt;</span><br><span class=\"line\">    &lt;title&gt;TryHackMe&lt;/title&gt;</span><br><span class=\"line\">&lt;/head&gt;</span><br><span class=\"line\">&lt;body&gt;</span><br><span class=\"line\">    Welcome To TryHackMe.com</span><br><span class=\"line\">&lt;/body&gt;</span><br><span class=\"line\">&lt;/html&gt;</span><br></pre></td></tr></table></figure>\n<p><strong>To breakdown each line of the response:</strong></p>\n<p><strong>Line 1:</strong> HTTP 1.1 is the version of the HTTP protocol the server is using and then followed by the HTTP Status Code in this case “200 Ok” which tells us the request has completed successfully.</p>\n<p><strong>Line 2:</strong> This tells us the web server software and version number.</p>\n<p><strong>Line 3:</strong> The current date, time and timezone of the web server.</p>\n<p><strong>Line 4:</strong> The Content-Type header tells the client what sort of information is going to be sent, such as HTML, images, videos, pdf, XML.</p>\n<p><strong>Line 5:</strong> Content-Length tells the client how long the response is, this way we can confirm no data is missing.</p>\n<p><strong>Line 6:</strong> HTTP response contains a blank line to confirm the end of the HTTP response.</p>\n<p><strong>Lines 7-14:</strong> The information that has been requested, in this instance the homepage.</p>\n<h3 id=\"Questions-and-Answers-in-the-task-1\"><a href=\"#Questions-and-Answers-in-the-task-1\" class=\"headerlink\" title=\"Questions and Answers in the task\"></a>Questions and Answers in the task</h3><p><strong>1. What HTTP protocol is being used in the above example?</strong><br>Answer:</p>\n<ul>\n<li><code>HTTP/1.1</code><br><strong>2. What response header tells the browser how much data to expect?</strong><br>Answer:</li>\n<li><code>content-length</code></li>\n</ul>\n<h1 id=\"HTTP-Methods\"><a href=\"#HTTP-Methods\" class=\"headerlink\" title=\"HTTP Methods\"></a>HTTP Methods</h1><p>HTTP methods are a way for the client to show their intended action when making an HTTP request. There are a lot of HTTP methods but we’ll cover the most common ones, although mostly you’ll deal with the GET and POST method.</p>\n<p><strong>GET Request</strong></p>\n<p>This is used for getting information from a web server.</p>\n<p><strong>POST Request</strong></p>\n<p>This is used for submitting data to the web server and potentially creating new records</p>\n<p><strong>PUT Request</strong></p>\n<p>This is used for submitting data to a web server to update information</p>\n<p><strong>DELETE Request</strong></p>\n<p>This is used for deleting information&#x2F;records from a web server.</p>\n<h2 id=\"Questions-and-Answers-in-the-Task\"><a href=\"#Questions-and-Answers-in-the-Task\" class=\"headerlink\" title=\"Questions and Answers in the Task\"></a>Questions and Answers in the Task</h2><ol>\n<li><strong>What method would be used to create a new user account?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>POST</code></li>\n</ul>\n<ol start=\"2\">\n<li><strong>What method would be used to update your email address?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>PUT</code></li>\n</ul>\n<ol start=\"3\">\n<li><strong>What method would be used to remove a picture you’ve uploaded to your account?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>DELETE</code></li>\n</ul>\n<ol start=\"4\">\n<li><strong>What method would be used to view a news article?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>GET</code></li>\n</ul>\n<h1 id=\"HTTP-Status-Codes\"><a href=\"#HTTP-Status-Codes\" class=\"headerlink\" title=\"HTTP Status Codes\"></a>HTTP Status Codes</h1><p><strong>HTTP Status Codes:</strong><br>In the previous task, you learnt that when a HTTP server responds, the first line always contains a status code informing the client of the outcome of their request and also potentially how to handle it. These status codes can be broken down into 5 different ranges:</p>\n<table>\n<thead>\n<tr>\n<th>Status Code Range</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>100-199</td>\n<td>Information Response - These are sent to tell the client the first part of their request has been accepted and they should continue sending the rest of their request. These codes are no longer very common.</td>\n</tr>\n<tr>\n<td>200-299</td>\n<td>Success - This range of status codes is used to tell the client their request was successful.</td>\n</tr>\n<tr>\n<td>300-399</td>\n<td>Redirection - These are used to redirect the client’s request to another resource. This can be either to a different webpage or a different website altogether.</td>\n</tr>\n<tr>\n<td>400-499</td>\n<td>Client Errors - Used to inform the client that there was an error with their request.</td>\n</tr>\n<tr>\n<td>500-599</td>\n<td>Server Errors - This is reserved for errors happening on the server-side and usually indicate quite a major problem with the server handling the request.</td>\n</tr>\n</tbody></table>\n<h2 id=\"Common-HTTP-Status-Codes\"><a href=\"#Common-HTTP-Status-Codes\" class=\"headerlink\" title=\"Common HTTP Status Codes\"></a>Common HTTP Status Codes</h2><table>\n<thead>\n<tr>\n<th>Status Code</th>\n<th>Description</th>\n</tr>\n</thead>\n<tbody><tr>\n<td>200 - OK</td>\n<td>The request was completed successfully.</td>\n</tr>\n<tr>\n<td>201 - Created</td>\n<td>A resource has been created (for example a new user or new blog post).</td>\n</tr>\n<tr>\n<td>301 - Moved Permanently</td>\n<td>This redirects the client’s browser to a new webpage or tells search engines that the page has moved somewhere else and to look there instead.</td>\n</tr>\n<tr>\n<td>302 - Found</td>\n<td>Similar to the above permanent redirect, but as the name suggests, this is only a temporary change and it may change again in the near future.</td>\n</tr>\n<tr>\n<td>400 - Bad Request</td>\n<td>This tells the browser that something was either wrong or missing in their request. This could sometimes be used if the web server resource that is being requested expected a certain parameter that the client didn’t send.</td>\n</tr>\n<tr>\n<td>401 - Not Authorised</td>\n<td>You are not currently allowed to view this resource until you have authorised with the web application, most commonly with a username and password.</td>\n</tr>\n<tr>\n<td>403 - Forbidden</td>\n<td>You do not have permission to view this resource whether you are logged in or not.</td>\n</tr>\n<tr>\n<td>404 - Page Not Found</td>\n<td>The page&#x2F;resource you requested does not exist.</td>\n</tr>\n<tr>\n<td>405 - Method Not Allowed</td>\n<td>The resource does not allow this method request, for example, you send a GET request to the resource &#x2F;create-account when it was expecting a POST request instead.</td>\n</tr>\n<tr>\n<td>500 - Internal Service Error</td>\n<td>The server has encountered some kind of error with your request that it doesn’t know how to handle properly.</td>\n</tr>\n<tr>\n<td>503 - Service Unavailable</td>\n<td>This server cannot handle your request as it’s either overloaded or down for maintenance.</td>\n</tr>\n</tbody></table>\n<h2 id=\"Questions-and-Answers-in-the-Task-1\"><a href=\"#Questions-and-Answers-in-the-Task-1\" class=\"headerlink\" title=\"Questions and Answers in the Task\"></a>Questions and Answers in the Task</h2><p><strong>1. What response code might you receive if you’ve created a new user or blog post article?</strong></p>\n<ul>\n<li>Answer: <code>201</code></li>\n</ul>\n<p><strong>2. What response code might you receive if you’ve tried to access a page that doesn’t exist?</strong></p>\n<ul>\n<li>Answer: <code>404</code></li>\n</ul>\n<p><strong>3. What response code might you receive if the web server cannot access its database and the application crashes?</strong></p>\n<ul>\n<li>Answer: <code>503</code></li>\n</ul>\n<p><strong>4. What response code might you receive if you try to edit your profile without logging in first?</strong></p>\n<ul>\n<li>Answer: <code>401</code></li>\n</ul>\n<h1 id=\"TASK-5-Headers\"><a href=\"#TASK-5-Headers\" class=\"headerlink\" title=\"TASK 5 - Headers\"></a>TASK 5 - Headers</h1><p>Headers are additional bits of data you can send to the web server when making requests.</p>\n<p>Although no headers are strictly required when making a HTTP request, you’ll find it difficult to view a website properly.</p>\n<h2 id=\"Common-Request-Headers\"><a href=\"#Common-Request-Headers\" class=\"headerlink\" title=\"Common Request Headers\"></a>Common Request Headers</h2><p>These are headers that are sent from the client (usually your browser) to the server.</p>\n<p><strong>Host:</strong> Some web servers host multiple websites so by providing the host headers you can tell it which one you require, otherwise you’ll just receive the default website for the server.</p>\n<p>User-Agent: This is your browser software and version number, telling the web server your browser software helps it format the website properly for your browser and also some elements of HTML, JavaScript and CSS are only available in certain browsers.</p>\n<p><strong>Content-Length:</strong> When sending data to a web server such as in a form, the content length tells the web server how much data to expect in the web request. This way the server can ensure it isn’t missing any data.</p>\n<p><strong>Accept-Encoding:</strong> Tells the web server what types of compression methods the browser supports so the data can be made smaller for transmitting over the internet.</p>\n<p><strong>Cookie:</strong> Data sent to the server to help remember your information (see cookies task for more information).<br>Common Response Headers</p>\n<p>These are the headers that are returned to the client from the server after a request.</p>\n<p><strong>Set-Cookie:</strong> Information to store which gets sent back to the web server on each request (see cookies task for more information).</p>\n<p><strong>Cache-Control:</strong> How long to store the content of the response in the browser’s cache before it requests it again.</p>\n<p><strong>Content-Type:</strong> This tells the client what type of data is being returned, i.e., HTML, CSS, JavaScript, Images, PDF, Video, etc. Using the content-type header the browser then knows how to process the data.</p>\n<p><strong>Content-Encoding:</strong> What method has been used to compress the data to make it smaller when sending it over the internet.</p>\n<h2 id=\"Answer-the-questions-below\"><a href=\"#Answer-the-questions-below\" class=\"headerlink\" title=\"Answer the questions below\"></a>Answer the questions below</h2><ol>\n<li><strong>What header tells the web server what browser is being used?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>user-agent</code></li>\n</ul>\n<ol start=\"2\">\n<li><strong>What header tells the browser what type of data is being returned?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>content-type</code></li>\n</ul>\n<ol start=\"3\">\n<li><strong>What header tells the web server which website is being requested?</strong></li>\n</ol>\n<ul>\n<li>Answer: <code>host</code></li>\n</ul>\n<h1 id=\"TASK-6-Cookies\"><a href=\"#TASK-6-Cookies\" class=\"headerlink\" title=\"TASK 6 - Cookies\"></a>TASK 6 - Cookies</h1><p>You’ve probably heard of cookies before, they’re just a small piece of data that is stored on your computer. Cookies are saved when you receive a “Set-Cookie” header from a web server. Then every further request you make, you’ll send the cookie data back to the web server. Because HTTP is stateless (doesn’t keep track of your previous requests), cookies can be used to remind the web server who you are, some personal settings for the website or whether you’ve been to the website before. Let’s take a look at this as an example HTTP request:<br><img src=\"https://tryhackme-images.s3.amazonaws.com/user-uploads/5c549500924ec576f953d9fc/room-content/a2117dc267fbb169e38be77c7af44027.png\" alt=\"2\"><br>A diagram visualizing how cookies are introduced in http requests to allow storing user information</p>\n<p>Cookies can be used for many purposes but are most commonly used for website authentication. The cookie value won’t usually be a clear-text string where you can see the password, but a token (unique secret code that isn’t easily humanly guessable).</p>\n<p><strong>Viewing Your Cookies</strong></p>\n<p>You can easily view what cookies your browser is sending to a website by using the developer tools, in your browser.</p>\n<h2 id=\"Questions-and-Answers-in-the-Task-2\"><a href=\"#Questions-and-Answers-in-the-Task-2\" class=\"headerlink\" title=\"Questions and Answers in the Task ?\"></a>Questions and Answers in the Task ?</h2><p><strong>1. which header is used to save cookies in your computer</strong></p>\n<ul>\n<li>Answer: <code>set-cookie</code></li>\n</ul>\n<p><strong>Making Requests</strong></p>\n<p>Click the “View Site” button on the right.</p>\n<p>This is an emulator for making demo HTTP requests, using what you’ve learnt from the above tasks you can use it to complete the below questions.</p>\n<h2 id=\"Questions-and-answers-in-the-task\"><a href=\"#Questions-and-answers-in-the-task\" class=\"headerlink\" title=\"Questions and answers in the task\"></a>Questions and answers in the task</h2><p><strong>1. Make a GET request to &#x2F;room</strong></p>\n<ul>\n<li><img src=\"https://dl.dropbox.com/scl/fi/zka60vbtxw0z2fc2njy69/inroom.png?rlkey=lex4glz9fhlfvkgyyq0c5i42n&st=goci7jq4&dl=0\" alt=\"2\"></li>\n<li>Answer: <code>THM&#123;YOU&#39;RE_IN_THE_ROOM&#125;</code></li>\n</ul>\n<p><strong>2. Make a GET request to &#x2F;blog and using the gear icon set the id parameter to 1 in the URL field</strong></p>\n<ul>\n<li><img src=\"https://dl.dropbox.com/scl/fi/lp9as6hbgznu1473zz2l9/found1.png?rlkey=pt0jzse3mibrf9rqrccgev6e3&st=zg5iv51t&dl=0\" alt=\"f1\"><br><img src=\"https://dl.dropbox.com/scl/fi/9tu1fm4bhccf2o8qar3lz/found2.png?rlkey=moiqn0fjfn4jxzc3jdtvboqj9&st=n2tp6bcl&dl=0\" alt=\"f2\"><br><img src=\"https://dl.dropbox.com/scl/fi/b2pihrhm5yutq18163ihl/found3.png?rlkey=27zug48tc71nj9lr6wyrqfqay&st=m7xc5pvl&dl=0\" alt=\"f3\"></li>\n<li>Answer: <code>THM&#123;YOU_FOUND_THE_BLOG&#125;</code></li>\n</ul>\n<p><strong>3. Make a DELETE request to &#x2F;user&#x2F;1</strong></p>\n<ul>\n<li><img src=\"https://dl.dropbox.com/scl/fi/b6zdtunz9brabxud9ieuj/delete1.png?rlkey=mdyrg5pw6yimea3eq8nccmbfa&st=ycxi4xoq&dl=0\" alt=\"delet1\"></li>\n<li>Answer: <code>THM&#123;USER_IS_DELETED&#125;</code></li>\n</ul>\n<p><strong>4. Make a PUT request to &#x2F;user&#x2F;2 with the username parameter set to admin</strong></p>\n<ul>\n<li><img src=\"https://dl.dropbox.com/scl/fi/4nrhb6lahog3sf9gilsnj/put1.png?rlkey=hbydddd5tjlv0i78jx31kl5mh&st=h0mogdsl&dl=0\" alt=\"put1\"><br><img src=\"https://dl.dropbox.com/scl/fi/ab8c1c5q9dsov5vrkt04d/put2.png?rlkey=7p040r6ak3hi8u3gsk9ewmhyb&st=qos98821&dl=0\" alt=\"put2\"><br><img src=\"https://dl.dropbox.com/scl/fi/wolslzwwjuih6jdcz99l3/put3.png?rlkey=rcj1l5j9ouwyup0pc1uccgoty&st=kyyrhxpy&dl=0\" alt=\"put3\"></li>\n<li>Answer: <code>THM&#123;USER_HAS_UPDATED&#125;</code></li>\n</ul>\n<p><strong>5. POST the username of thm and a password of letmein to &#x2F;login</strong></p>\n<ul>\n<li><img src=\"https://dl.dropbox.com/scl/fi/vkq4yjrim16nr4ckhbhqz/post1.png?rlkey=qybmabgxnosj4b1wlv2hnb8xu&st=ttwe0cql&dl=0\" alt=\"post1\"><br><img src=\"https://dl.dropbox.com/scl/fi/wvmj6zlublamaq5gwj9bx/post3.png?rlkey=svw39pgd70j8q6vy540qgiqf6&st=pz6z94hv&dl=0\" alt=\"post3\"><br><img src=\"https://dl.dropbox.com/scl/fi/zbscjuia9a6ml4cz0o3vo/post4.png?rlkey=18nwk4cr714xae2sp8uwr5re4&st=3orc9xea&dl=0\" alt=\"post4\"></li>\n<li>Answer: <code>THM&#123;HTTP_REQUEST_MASTER&#125;</code></li>\n</ul>\n<p><strong>Thank You</strong> 💌<br><strong>Author:</strong> <code>Satvik Shetty</code>🧑‍💻<br><strong>See you again in another writeup</strong></p>\n","text":"HTTP in DetailWhat is HTTP? (HyperText Transfer Protocol)HTTP is what’s used whe...","permalink":"/post/THM/WEB/HTTP-in-detail-THM","photos":[],"count_time":{"symbolsCount":"13k","symbolsTime":"12 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":20,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":19,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":13,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":19,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":13,"path":"api/tags/web.json"}],"toc":"<ol class=\"toc\"><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#HTTP-in-Detail\"><span class=\"toc-text\">HTTP in Detail</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#What-is-HTTP-HyperText-Transfer-Protocol\"><span class=\"toc-text\">What is HTTP? (HyperText Transfer Protocol)</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-task\"><span class=\"toc-text\">Questions and Answers in the task</span></a></li></ol></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#Requests-and-Responses\"><span class=\"toc-text\">Requests and Responses</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#What-is-a-URL-Uniform-Resource-Locator\"><span class=\"toc-text\">What is a URL? (Uniform Resource Locator)</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-3\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-task-1\"><span class=\"toc-text\">Questions and Answers in the task</span></a></li></ol></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#HTTP-Methods\"><span class=\"toc-text\">HTTP Methods</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task\"><span class=\"toc-text\">Questions and Answers in the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#HTTP-Status-Codes\"><span class=\"toc-text\">HTTP Status Codes</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Common-HTTP-Status-Codes\"><span class=\"toc-text\">Common HTTP Status Codes</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task-1\"><span class=\"toc-text\">Questions and Answers in the Task</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-5-Headers\"><span class=\"toc-text\">TASK 5 - Headers</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Common-Request-Headers\"><span class=\"toc-text\">Common Request Headers</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Answer-the-questions-below\"><span class=\"toc-text\">Answer the questions below</span></a></li></ol></li><li class=\"toc-item toc-level-1\"><a class=\"toc-link\" href=\"#TASK-6-Cookies\"><span class=\"toc-text\">TASK 6 - Cookies</span></a><ol class=\"toc-child\"><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-Answers-in-the-Task-2\"><span class=\"toc-text\">Questions and Answers in the Task ?</span></a></li><li class=\"toc-item toc-level-2\"><a class=\"toc-link\" href=\"#Questions-and-answers-in-the-task\"><span class=\"toc-text\">Questions and answers in the task</span></a></li></ol></li></ol>","author":{"name":"Satvik","slug":"blog-author","avatar":"https://dl.dropbox.com/scl/fi/00hpz9sf96v4gugpvx7t9/profile.jpg?rlkey=yet0g0rb9ofkl806vvhmkjail&st=3rw0pj88&dl=0","link":"https://dl.dropbox.com/scl/fi/00hpz9sf96v4gugpvx7t9/profile.jpg?rlkey=yet0g0rb9ofkl806vvhmkjail&st=3rw0pj88&dl=0","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}},"mapped":true,"hidden":false,"prev_post":{"title":"How Websites Work - THM Walkthrough","uid":"04c3f082e63bec82336499ba808815fb","slug":"THM/WEB/How-Websites-Work-THM-Walkthrough","date":"2024-05-23T09:28:53.000Z","updated":"2024-05-23T12:29:10.619Z","comments":true,"path":"api/articles/THM/WEB/How-Websites-Work-THM-Walkthrough.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/4e3a3940e2a4ab1b058e2e199f2af0b4.svg","text":"Hello Hackers 💌Today we will be walking through a new room on tryhackme called H...","permalink":"/post/THM/WEB/How-Websites-Work-THM-Walkthrough","photos":[],"count_time":{"symbolsCount":"8.6k","symbolsTime":"8 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":20,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":19,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":13,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":19,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":13,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://dl.dropbox.com/scl/fi/00hpz9sf96v4gugpvx7t9/profile.jpg?rlkey=yet0g0rb9ofkl806vvhmkjail&st=3rw0pj88&dl=0","link":"https://dl.dropbox.com/scl/fi/00hpz9sf96v4gugpvx7t9/profile.jpg?rlkey=yet0g0rb9ofkl806vvhmkjail&st=3rw0pj88&dl=0","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}}},"next_post":{"title":"DNS in Detail - THM","uid":"b79812bf9f9c79ac4e4543b225fa1821","slug":"THM/WEB/DNS-in-Detail","date":"2024-05-22T17:28:57.000Z","updated":"2024-05-23T09:32:59.159Z","comments":true,"path":"api/articles/THM/WEB/DNS-in-Detail.json","keywords":null,"cover":"https://tryhackme-images.s3.amazonaws.com/room-icons/59ce45d7405858110cb10b5c04eabb4c.png","text":"DNS in DetailTASK - 1 What is DNS?What is DNS?DNS (Domain Name System) provides ...","permalink":"/post/THM/WEB/DNS-in-Detail","photos":[],"count_time":{"symbolsCount":"7.3k","symbolsTime":"7 mins."},"categories":[{"name":"cybersecurity","slug":"cybersecurity","count":20,"path":"api/categories/cybersecurity.json"},{"name":"THM","slug":"cybersecurity/THM","count":19,"path":"api/categories/cybersecurity/THM.json"},{"name":"web","slug":"cybersecurity/THM/web","count":13,"path":"api/categories/cybersecurity/THM/web.json"}],"tags":[{"name":"tryhackme","slug":"tryhackme","count":19,"path":"api/tags/tryhackme.json"},{"name":"web","slug":"web","count":13,"path":"api/tags/web.json"}],"author":{"name":"Satvik","slug":"blog-author","avatar":"https://dl.dropbox.com/scl/fi/00hpz9sf96v4gugpvx7t9/profile.jpg?rlkey=yet0g0rb9ofkl806vvhmkjail&st=3rw0pj88&dl=0","link":"https://dl.dropbox.com/scl/fi/00hpz9sf96v4gugpvx7t9/profile.jpg?rlkey=yet0g0rb9ofkl806vvhmkjail&st=3rw0pj88&dl=0","description":"An Aspiring Penetration Tester & a security Enthusiast 🚀 127.0.0.1 / sudo rm -rf / 😁 Dont Drink and Root 👀","socials":{"github":"https://github.com/satvik-vs","twitter":"https://twitter.com/SatvikVemulap2","stackoverflow":"","wechat":"","qq":"","weibo":"","zhihu":"","csdn":"","juejin":"","customs":{"instagram":{"icon":"fab fa-instagram","link":"https://instagram.com/satvikshetty"}}}}}}